app/Helpers/level_helper.php

SELECT `a`.`kategori_user`
FROM `kategori_user_modul` `a`
JOIN `modul` `b` ON `b`.`id` = `a`.`modul`
WHERE `a`.`kategori_user` = 'JBT8b4e1656e7b810f70d908c97ae1e61e26d592b25QNS'
AND `a`.`akses` = 'read'
AND `b`.`nama_function` = 'data'
AND `b`.`controller` = 'proyek'
---
    function level_user(string $namaController, string $namaFunction, string $kategori, string $akses): string
    {
        $db = db_connect(); // Mengambil koneksi database

        $query = $db->table('kategori_user_modul a')
            ->join('modul b', 'b.id = a.modul')
            ->select('a.kategori_user')
            ->where([
                'a.kategori_user' => $kategori,
                'a.akses' => $akses,
                'b.nama_function' => $namaFunction,
                'b.controller' => $namaController,
            ])
            ->get();