app/Controllers/Dashboard.php

SELECT *
FROM `master_admin`
WHERE `id` = 'USRdbc1087b5a6676dba1c7336a94e85fa3e0ba282dQNS'
SELECT *
FROM `master_admin`
WHERE `id` = 'USRdbc1087b5a6676dba1c7336a94e85fa3e0ba282dQNS'
 LIMIT 1
SELECT *
FROM `master_pkp`
WHERE `id_pkp` = 'PKP9d6e048e64d5d208a2f99c15ddfcb2a9d7035384QNS'
 LIMIT 1
SELECT *
FROM `master_instansi`
WHERE `id` = 'INSe5a9283226f5c5d3adc6bc27f6fcdb87b15005bdQNS'
 LIMIT 1
SELECT `a`.`tahun`, `a`.`bulan`, `a`.`alert`, `b`.`warning`, `b`.`late`, `b`.`proyek`, `a`.`id_pkp`, `a`.`bobot_pg`, `a`.`rensd_mgll`, `a`.`rilsd_mgll`, `a`.`devsd_mgll`, `a`.`ren_mgini`, `a`.`ril_mgini`, `a`.`dev_mgini`, `a`.`rensd_mgini`, `a`.`rilsd_mgini`, `a`.`devsd_mgini`, `a`.`sisa_bobotpg`, `a`.`tgl_mulai`, `a`.`tgl_selesai`, `a`.`sisa_waktu`, `a`.`target_minggu`, `b`.`alias`, `a`.`tgl_ubah_progress`, `b`.`tgl_close`, `b`.`validasi_kapro`
FROM `progress_proyek` `a`
JOIN `master_pkp` `b` ON `a`.`id_pkp` = `b`.`id_pkp`
JOIN `master_instansi` `c` ON `b`.`id_instansi` = `c`.`id`
WHERE `a`.`akhir` = 'A'
AND `c`.`nomor` = '511'
ORDER BY `b`.`no_pkp` DESC
---
     public function index()
    {
        $data['kode'] = '01';
        $data['judul'] = 'MAIN DASHBOARD';
        date_default_timezone_set("Asia/Jakarta");
        $now = date("Y-m-d");
        $tgl_terawan = date('Y-m-d', strtotime('-365 days', strtotime($now)));

        $idQNS = session('idadmin');
        $isi = $this->db->table("master_admin")->where('id', $idQNS, 1)->get()->getRow();
        $kategoriQNS = $isi->kategori_user;
        $id_pkp2 = $isi->pkp_user;
        $username = $isi->username;
        $proyek = $this->db->table('master_admin')->getWhere(['id' => $idQNS], 1);
        $pkp_user = $proyek->getRow()->pkp_user;


        if ($pkp_user != '') {
            $divisi = $this->db->table('master_pkp')->getWhere(['id_pkp' => $pkp_user], 1);
            $id_divisi = $divisi->getRow()->id_instansi;
            $div = $this->db->table('master_instansi')->getWhere(['id' => $id_divisi], 1);
            $no_divisi = $div->getRow()->nomor;
        }

        if (!level_user('dashboard', 'index', $kategoriQNS, 'read') > 0) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        if ((level_user('dashboard', 'index', $kategoriQNS, 'all') > 0) or (level_user('gedung', '1', $kategoriQNS, 'read') > 0)) {
            $data['proyek1'] = $this->db->table("progress_proyek a")->select("a.tahun,a.bulan,a.alert,b.warning,b.late,b.proyek,a.id_pkp,a.bobot_pg,a.rensd_mgll,a.rilsd_mgll,a.devsd_mgll,a.ren_mgini,a.ril_mgini,a.dev_mgini,a.rensd_mgini,a.rilsd_mgini,a.devsd_mgini,a.sisa_bobotpg,a.tgl_mulai,a.tgl_selesai,a.sisa_waktu,a.target_minggu,b.alias,a.tgl_ubah_progress,b.tgl_close,b.validasi_kapro")->join('master_pkp b', 'a.id_pkp = b.id_pkp')->join('master_instansi c', 'b.id_instansi = c.id')->where('a.akhir', 'A')->where('c.nomor', '511')->orderBy('b.no_pkp', 'DESC')->get()->getResult();

SELECT `a`.`tahun`, `a`.`bulan`, `a`.`alert`, `b`.`warning`, `b`.`late`, `b`.`proyek`, `a`.`id_pkp`, `a`.`bobot_pg`, `a`.`rensd_mgll`, `a`.`rilsd_mgll`, `a`.`devsd_mgll`, `a`.`ren_mgini`, `a`.`ril_mgini`, `a`.`dev_mgini`, `a`.`rensd_mgini`, `a`.`rilsd_mgini`, `a`.`devsd_mgini`, `a`.`sisa_bobotpg`, `a`.`tgl_mulai`, `a`.`tgl_selesai`, `a`.`sisa_waktu`, `a`.`target_minggu`, `b`.`alias`, `a`.`tgl_ubah_progress`, `b`.`tgl_close`, `b`.`validasi_kapro`
FROM `progress_proyek` `a`
JOIN `master_pkp` `b` ON `a`.`id_pkp` = `b`.`id_pkp`
JOIN `master_instansi` `c` ON `b`.`id_instansi` = `c`.`id`
WHERE `a`.`akhir` = 'A'
AND `c`.`nomor` = '512'
ORDER BY `b`.`no_pkp` DESC
---

        if ((level_user('dashboard', 'index', $kategoriQNS, 'all') > 0) or (level_user('gedung', '2', $kategoriQNS, 'read') > 0) /*or ($username == '10288')*/) {

            $data['proyek2'] = $this->db->table("progress_proyek a")->select("a.tahun,a.bulan,a.alert,b.warning,b.late,b.proyek,a.id_pkp,a.bobot_pg,a.rensd_mgll,a.rilsd_mgll,a.devsd_mgll,a.ren_mgini,a.ril_mgini,a.dev_mgini,a.rensd_mgini,a.rilsd_mgini,a.devsd_mgini,a.sisa_bobotpg,a.tgl_mulai,a.tgl_selesai,a.sisa_waktu,a.target_minggu,b.alias,a.tgl_ubah_progress,b.tgl_close,b.validasi_kapro")->join('master_pkp b', 'a.id_pkp = b.id_pkp')->join('master_instansi c', 'b.id_instansi = c.id')->where('a.akhir', 'A')->where('c.nomor', '512')->orderBy('b.no_pkp', 'DESC')->get()->getResult();

SELECT `a`.`tahun`, `a`.`bulan`, `a`.`alert`, `b`.`warning`, `b`.`late`, `b`.`proyek`, `a`.`id_pkp`, `a`.`bobot_pg`, `a`.`rensd_mgll`, `a`.`rilsd_mgll`, `a`.`devsd_mgll`, `a`.`ren_mgini`, `a`.`ril_mgini`, `a`.`dev_mgini`, `a`.`rensd_mgini`, `a`.`rilsd_mgini`, `a`.`devsd_mgini`, `a`.`sisa_bobotpg`, `a`.`tgl_mulai`, `a`.`tgl_selesai`, `a`.`sisa_waktu`, `a`.`target_minggu`, `b`.`alias`, `a`.`tgl_ubah_progress`, `b`.`tgl_close`, `b`.`validasi_kapro`
FROM `progress_proyek` `a`
JOIN `master_pkp` `b` ON `a`.`id_pkp` = `b`.`id_pkp`
JOIN `master_instansi` `c` ON `b`.`id_instansi` = `c`.`id`
WHERE `a`.`akhir` = 'A'
AND `c`.`nomor` = '611'
ORDER BY `b`.`no_pkp` DESC
---

        if ((level_user('dashboard', 'index', $kategoriQNS, 'all') > 0) or (level_user('ktl', '1', $kategoriQNS, 'read') > 0)) {

            $data['ktl'] = $this->db->table("progress_proyek a")->select("a.tahun,a.bulan,a.alert,b.warning,b.late,b.proyek,a.id_pkp,a.bobot_pg,a.rensd_mgll,a.rilsd_mgll,a.devsd_mgll,a.ren_mgini,a.ril_mgini,a.dev_mgini,a.rensd_mgini,a.rilsd_mgini,a.devsd_mgini,a.sisa_bobotpg,a.tgl_mulai,a.tgl_selesai,a.sisa_waktu,a.target_minggu,b.alias,a.tgl_ubah_progress,b.tgl_close,b.validasi_kapro")->join('master_pkp b', 'a.id_pkp = b.id_pkp')->join('master_instansi c', 'b.id_instansi = c.id')->where('a.akhir', 'A')->where('c.nomor', '611')->orderBy('b.no_pkp', 'DESC')->get()->getResult();

SELECT `a`.`tahun`, `a`.`bulan`, `a`.`alert`, `b`.`warning`, `b`.`late`, `b`.`proyek`, `a`.`id_pkp`, `a`.`bobot_pg`, `a`.`rensd_mgll`, `a`.`rilsd_mgll`, `a`.`devsd_mgll`, `a`.`ren_mgini`, `a`.`ril_mgini`, `a`.`dev_mgini`, `a`.`rensd_mgini`, `a`.`rilsd_mgini`, `a`.`devsd_mgini`, `a`.`sisa_bobotpg`, `a`.`tgl_mulai`, `a`.`tgl_selesai`, `a`.`sisa_waktu`, `a`.`target_minggu`, `b`.`alias`, `a`.`tgl_ubah_progress`, `b`.`tgl_close`, `b`.`validasi_kapro`
FROM `progress_proyek` `a`
JOIN `master_pkp` `b` ON `a`.`id_pkp` = `b`.`id_pkp`
JOIN `master_instansi` `c` ON `b`.`id_instansi` = `c`.`id`
WHERE `a`.`akhir` = 'A'
AND `c`.`nomor` = '612'
ORDER BY `b`.`no_pkp` DESC
---

        if ((level_user('dashboard', 'index', $kategoriQNS, 'all') > 0) or (level_user('ktl', '2', $kategoriQNS, 'read') > 0)) {

            $data['ktl2'] = $this->db->table("progress_proyek a")->select("a.tahun,a.bulan,a.alert,b.warning,b.late,b.proyek,a.id_pkp,a.bobot_pg,a.rensd_mgll,a.rilsd_mgll,a.devsd_mgll,a.ren_mgini,a.ril_mgini,a.dev_mgini,a.rensd_mgini,a.rilsd_mgini,a.devsd_mgini,a.sisa_bobotpg,a.tgl_mulai,a.tgl_selesai,a.sisa_waktu,a.target_minggu,b.alias,a.tgl_ubah_progress,b.tgl_close,b.validasi_kapro")->join('master_pkp b', 'a.id_pkp = b.id_pkp')->join('master_instansi c', 'b.id_instansi = c.id')->where('a.akhir', 'A')->where('c.nomor', '612')->orderBy('b.no_pkp', 'DESC')->get()->getResult();

SELECT `a`.`tahun`, `a`.`bulan`, `a`.`alert`, `b`.`warning`, `b`.`late`, `b`.`proyek`, `a`.`id_pkp`, `a`.`bobot_pg`, `a`.`rensd_mgll`, `a`.`rilsd_mgll`, `a`.`devsd_mgll`, `a`.`ren_mgini`, `a`.`ril_mgini`, `a`.`dev_mgini`, `a`.`rensd_mgini`, `a`.`rilsd_mgini`, `a`.`devsd_mgini`, `a`.`sisa_bobotpg`, `a`.`tgl_mulai`, `a`.`tgl_selesai`, `a`.`sisa_waktu`, `a`.`target_minggu`, `b`.`alias`, `a`.`tgl_ubah_progress`, `b`.`tgl_close`, `b`.`validasi_kapro`
FROM `progress_proyek` `a`
JOIN `master_pkp` `b` ON `a`.`id_pkp` = `b`.`id_pkp`
JOIN `master_instansi` `c` ON `b`.`id_instansi` = `c`.`id`
WHERE `a`.`akhir` = 'A'
AND `c`.`nomor` = '711'
ORDER BY `b`.`no_pkp` DESC
---

        if ((level_user('dashboard', 'index', $kategoriQNS, 'all') > 0) or (level_user('trans', '1', $kategoriQNS, 'read') > 0)) {

            $data['trans'] = $this->db->table("progress_proyek a")->select("a.tahun,a.bulan,a.alert,b.warning,b.late,b.proyek,a.id_pkp,a.bobot_pg,a.rensd_mgll,a.rilsd_mgll,a.devsd_mgll,a.ren_mgini,a.ril_mgini,a.dev_mgini,a.rensd_mgini,a.rilsd_mgini,a.devsd_mgini,a.sisa_bobotpg,a.tgl_mulai,a.tgl_selesai,a.sisa_waktu,a.target_minggu,b.alias,a.tgl_ubah_progress,b.tgl_close,b.validasi_kapro")->join('master_pkp b', 'a.id_pkp = b.id_pkp')->join('master_instansi c', 'b.id_instansi = c.id')->where('a.akhir', 'A')->where('c.nomor', '711')->orderBy('b.no_pkp', 'DESC')->get()->getResult();

SELECT `a`.`tahun`, `a`.`bulan`, `a`.`alert`, `b`.`warning`, `b`.`late`, `b`.`proyek`, `a`.`id_pkp`, `a`.`bobot_pg`, `a`.`rensd_mgll`, `a`.`rilsd_mgll`, `a`.`devsd_mgll`, `a`.`ren_mgini`, `a`.`ril_mgini`, `a`.`dev_mgini`, `a`.`rensd_mgini`, `a`.`rilsd_mgini`, `a`.`devsd_mgini`, `a`.`sisa_bobotpg`, `a`.`tgl_mulai`, `a`.`tgl_selesai`, `a`.`sisa_waktu`, `a`.`target_minggu`, `b`.`alias`, `a`.`tgl_ubah_progress`, `b`.`tgl_close`, `b`.`validasi_kapro`
FROM `progress_proyek` `a`
JOIN `master_pkp` `b` ON `a`.`id_pkp` = `b`.`id_pkp`
JOIN `master_instansi` `c` ON `b`.`id_instansi` = `c`.`id`
WHERE `a`.`akhir` = 'A'
AND `c`.`nomor` = '712'
ORDER BY `b`.`no_pkp` DESC
---

        if ((level_user('dashboard', 'index', $kategoriQNS, 'all') > 0) or (level_user('trans', '2', $kategoriQNS, 'read') > 0)) {

            $data['trans2'] = $this->db->table("progress_proyek a")->select("a.tahun,a.bulan,a.alert,b.warning,b.late,b.proyek,a.id_pkp,a.bobot_pg,a.rensd_mgll,a.rilsd_mgll,a.devsd_mgll,a.ren_mgini,a.ril_mgini,a.dev_mgini,a.rensd_mgini,a.rilsd_mgini,a.devsd_mgini,a.sisa_bobotpg,a.tgl_mulai,a.tgl_selesai,a.sisa_waktu,a.target_minggu,b.alias,a.tgl_ubah_progress,b.tgl_close,b.validasi_kapro")->join('master_pkp b', 'a.id_pkp = b.id_pkp')->join('master_instansi c', 'b.id_instansi = c.id')->where('a.akhir', 'A')->where('c.nomor', '712')->orderBy('b.no_pkp', 'DESC')->get()->getResult();

SELECT `b`.`nomor`, `a`.`no_pkp`, `a`.`alias`, `a`.`proyek`, `a`.`tgl_mulai`, `a`.`tgl_selesai`, `a`.`nilai_jaminan`, `a`.`tgl_jaminan`, `a`.`bast_1`, `a`.`bast_2`, `a`.`referensi`, `a`.`id_pkp`
FROM `master_pkp` `a`
JOIN `master_instansi` `b` ON `a`.`id_instansi` = `b`.`id`
WHERE `a`.`tgl_ubah_progress` > '2010-01-01'
ORDER BY `b`.`nomor`, `a`.`no_pkp` DESC
---
            }
        }
        if ((level_user('dashboard', 'index', $kategoriQNS, 'all') > 0) or (level_user('dashboard', 'index', $kategoriQNS, 'divisi') > 0 and $no_divisi == '412')) {
            $data['marketing'] = $this->db->table('master_pkp a')->select("b.nomor,a.no_pkp,a.alias,a.proyek,a.tgl_mulai,a.tgl_selesai,a.nilai_jaminan,a.tgl_jaminan,a.bast_1,a.bast_2,a.referensi,a.id_pkp")->join('master_instansi b', 'a.id_instansi = b.id')->where('a.tgl_ubah_progress >', '2010-01-01')->orderBy('b.nomor')->orderBy('a.no_pkp', 'DESC')->get()->getResult();

SELECT *
FROM `master_admin`
WHERE `id` = 'USRdbc1087b5a6676dba1c7336a94e85fa3e0ba282dQNS'
 LIMIT 1
SELECT *
FROM `master_pkp`
WHERE `id_pkp` = 'PKP9d6e048e64d5d208a2f99c15ddfcb2a9d7035384QNS'
 LIMIT 1
SELECT *
FROM `master_instansi`
WHERE `id` = 'INSe5a9283226f5c5d3adc6bc27f6fcdb87b15005bdQNS'
 LIMIT 1
SELECT `a`.`tahun`, `a`.`bulan`, `a`.`alert`, `b`.`warning`, `b`.`late`, `b`.`proyek`, `a`.`id_pkp`, `a`.`bobot_pg`, `a`.`rensd_mgll`, `a`.`rilsd_mgll`, `a`.`devsd_mgll`, `a`.`ren_mgini`, `a`.`ril_mgini`, `a`.`dev_mgini`, `a`.`rensd_mgini`, `a`.`rilsd_mgini`, `a`.`devsd_mgini`, `a`.`sisa_bobotpg`, `a`.`tgl_mulai`, `a`.`tgl_selesai`, `a`.`sisa_waktu`, `a`.`target_minggu`, `b`.`alias`, `a`.`tgl_ubah_progress`, `b`.`tgl_close`, `b`.`validasi_kapro`
FROM `progress_proyek` `a`
JOIN `master_pkp` `b` ON `a`.`id_pkp` = `b`.`id_pkp`
JOIN `master_instansi` `c` ON `b`.`id_instansi` = `c`.`id`
WHERE `a`.`akhir` = 'A'
AND `c`.`nomor` = '511'
ORDER BY `b`.`no_pkp` DESC
---
    public function beranda_01()
    {
        $data['kode'] = '01';
        $data['judul'] = 'MAIN DASHBOARD';
        date_default_timezone_set("Asia/Jakarta");
        $now = date("Y-m-d");
        $tgl_terawan = date('Y-m-d', strtotime('-365 days', strtotime($now)));

        $idQNS = session('idadmin');
        $isi = $this->db->table("master_admin")->where('id', $idQNS, 1)->get()->getRow();
        $kategoriQNS = $isi->kategori_user;
        $id_pkp2 = $isi->pkp_user;
        $username = $isi->username;
        $proyek = $this->db->table('master_admin')->getWhere(['id' => $idQNS], 1);
        $pkp_user = $proyek->getRow()->pkp_user;


        if ($pkp_user != '') {
            $divisi = $this->db->table('master_pkp')->getWhere(['id_pkp' => $pkp_user], 1);
            $id_divisi = $divisi->getRow()->id_instansi;
            $div = $this->db->table('master_instansi')->getWhere(['id' => $id_divisi], 1);
            $no_divisi = $div->getRow()->nomor;
        }

        if (!level_user('dashboard', 'index', $kategoriQNS, 'read') > 0) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        if ((level_user('dashboard', 'index', $kategoriQNS, 'all') > 0) or (level_user('gedung', '1', $kategoriQNS, 'read') > 0)) {
            $data['proyek1'] = $this->db->table("progress_proyek a")->select("a.tahun,a.bulan,a.alert,b.warning,b.late,b.proyek,a.id_pkp,a.bobot_pg,a.rensd_mgll,a.rilsd_mgll,a.devsd_mgll,a.ren_mgini,a.ril_mgini,a.dev_mgini,a.rensd_mgini,a.rilsd_mgini,a.devsd_mgini,a.sisa_bobotpg,a.tgl_mulai,a.tgl_selesai,a.sisa_waktu,a.target_minggu,b.alias,a.tgl_ubah_progress,b.tgl_close,b.validasi_kapro")->join('master_pkp b', 'a.id_pkp = b.id_pkp')->join('master_instansi c', 'b.id_instansi = c.id')->where('a.akhir', 'A')->where('c.nomor', '511')->orderBy('b.no_pkp', 'DESC')->get()->getResult();

SELECT `a`.`tahun`, `a`.`bulan`, `a`.`alert`, `b`.`warning`, `b`.`late`, `b`.`proyek`, `a`.`id_pkp`, `a`.`bobot_pg`, `a`.`rensd_mgll`, `a`.`rilsd_mgll`, `a`.`devsd_mgll`, `a`.`ren_mgini`, `a`.`ril_mgini`, `a`.`dev_mgini`, `a`.`rensd_mgini`, `a`.`rilsd_mgini`, `a`.`devsd_mgini`, `a`.`sisa_bobotpg`, `a`.`tgl_mulai`, `a`.`tgl_selesai`, `a`.`sisa_waktu`, `a`.`target_minggu`, `b`.`alias`, `a`.`tgl_ubah_progress`, `b`.`tgl_close`, `b`.`validasi_kapro`
FROM `progress_proyek` `a`
JOIN `master_pkp` `b` ON `a`.`id_pkp` = `b`.`id_pkp`
JOIN `master_instansi` `c` ON `b`.`id_instansi` = `c`.`id`
WHERE `a`.`akhir` = 'A'
AND `c`.`nomor` = '512'
ORDER BY `b`.`no_pkp` DESC
---

        if ((level_user('dashboard', 'index', $kategoriQNS, 'all') > 0) or (level_user('gedung', '2', $kategoriQNS, 'read') > 0) /*or ($username == '10288')*/) {

            $data['proyek2'] = $this->db->table("progress_proyek a")->select("a.tahun,a.bulan,a.alert,b.warning,b.late,b.proyek,a.id_pkp,a.bobot_pg,a.rensd_mgll,a.rilsd_mgll,a.devsd_mgll,a.ren_mgini,a.ril_mgini,a.dev_mgini,a.rensd_mgini,a.rilsd_mgini,a.devsd_mgini,a.sisa_bobotpg,a.tgl_mulai,a.tgl_selesai,a.sisa_waktu,a.target_minggu,b.alias,a.tgl_ubah_progress,b.tgl_close,b.validasi_kapro")->join('master_pkp b', 'a.id_pkp = b.id_pkp')->join('master_instansi c', 'b.id_instansi = c.id')->where('a.akhir', 'A')->where('c.nomor', '512')->orderBy('b.no_pkp', 'DESC')->get()->getResult();

SELECT `a`.`tahun`, `a`.`bulan`, `a`.`alert`, `b`.`warning`, `b`.`late`, `b`.`proyek`, `a`.`id_pkp`, `a`.`bobot_pg`, `a`.`rensd_mgll`, `a`.`rilsd_mgll`, `a`.`devsd_mgll`, `a`.`ren_mgini`, `a`.`ril_mgini`, `a`.`dev_mgini`, `a`.`rensd_mgini`, `a`.`rilsd_mgini`, `a`.`devsd_mgini`, `a`.`sisa_bobotpg`, `a`.`tgl_mulai`, `a`.`tgl_selesai`, `a`.`sisa_waktu`, `a`.`target_minggu`, `b`.`alias`, `a`.`tgl_ubah_progress`, `b`.`tgl_close`, `b`.`validasi_kapro`
FROM `progress_proyek` `a`
JOIN `master_pkp` `b` ON `a`.`id_pkp` = `b`.`id_pkp`
JOIN `master_instansi` `c` ON `b`.`id_instansi` = `c`.`id`
WHERE `a`.`akhir` = 'A'
AND `c`.`nomor` = '611'
ORDER BY `b`.`no_pkp` DESC
---

        if ((level_user('dashboard', 'index', $kategoriQNS, 'all') > 0) or (level_user('ktl', '1', $kategoriQNS, 'read') > 0)) {

            $data['ktl'] = $this->db->table("progress_proyek a")->select("a.tahun,a.bulan,a.alert,b.warning,b.late,b.proyek,a.id_pkp,a.bobot_pg,a.rensd_mgll,a.rilsd_mgll,a.devsd_mgll,a.ren_mgini,a.ril_mgini,a.dev_mgini,a.rensd_mgini,a.rilsd_mgini,a.devsd_mgini,a.sisa_bobotpg,a.tgl_mulai,a.tgl_selesai,a.sisa_waktu,a.target_minggu,b.alias,a.tgl_ubah_progress,b.tgl_close,b.validasi_kapro")->join('master_pkp b', 'a.id_pkp = b.id_pkp')->join('master_instansi c', 'b.id_instansi = c.id')->where('a.akhir', 'A')->where('c.nomor', '611')->orderBy('b.no_pkp', 'DESC')->get()->getResult();

SELECT `a`.`tahun`, `a`.`bulan`, `a`.`alert`, `b`.`warning`, `b`.`late`, `b`.`proyek`, `a`.`id_pkp`, `a`.`bobot_pg`, `a`.`rensd_mgll`, `a`.`rilsd_mgll`, `a`.`devsd_mgll`, `a`.`ren_mgini`, `a`.`ril_mgini`, `a`.`dev_mgini`, `a`.`rensd_mgini`, `a`.`rilsd_mgini`, `a`.`devsd_mgini`, `a`.`sisa_bobotpg`, `a`.`tgl_mulai`, `a`.`tgl_selesai`, `a`.`sisa_waktu`, `a`.`target_minggu`, `b`.`alias`, `a`.`tgl_ubah_progress`, `b`.`tgl_close`, `b`.`validasi_kapro`
FROM `progress_proyek` `a`
JOIN `master_pkp` `b` ON `a`.`id_pkp` = `b`.`id_pkp`
JOIN `master_instansi` `c` ON `b`.`id_instansi` = `c`.`id`
WHERE `a`.`akhir` = 'A'
AND `c`.`nomor` = '612'
ORDER BY `b`.`no_pkp` DESC
---

        if ((level_user('dashboard', 'index', $kategoriQNS, 'all') > 0) or (level_user('ktl', '2', $kategoriQNS, 'read') > 0)) {

            $data['ktl2'] = $this->db->table("progress_proyek a")->select("a.tahun,a.bulan,a.alert,b.warning,b.late,b.proyek,a.id_pkp,a.bobot_pg,a.rensd_mgll,a.rilsd_mgll,a.devsd_mgll,a.ren_mgini,a.ril_mgini,a.dev_mgini,a.rensd_mgini,a.rilsd_mgini,a.devsd_mgini,a.sisa_bobotpg,a.tgl_mulai,a.tgl_selesai,a.sisa_waktu,a.target_minggu,b.alias,a.tgl_ubah_progress,b.tgl_close,b.validasi_kapro")->join('master_pkp b', 'a.id_pkp = b.id_pkp')->join('master_instansi c', 'b.id_instansi = c.id')->where('a.akhir', 'A')->where('c.nomor', '612')->orderBy('b.no_pkp', 'DESC')->get()->getResult();

SELECT `a`.`tahun`, `a`.`bulan`, `a`.`alert`, `b`.`warning`, `b`.`late`, `b`.`proyek`, `a`.`id_pkp`, `a`.`bobot_pg`, `a`.`rensd_mgll`, `a`.`rilsd_mgll`, `a`.`devsd_mgll`, `a`.`ren_mgini`, `a`.`ril_mgini`, `a`.`dev_mgini`, `a`.`rensd_mgini`, `a`.`rilsd_mgini`, `a`.`devsd_mgini`, `a`.`sisa_bobotpg`, `a`.`tgl_mulai`, `a`.`tgl_selesai`, `a`.`sisa_waktu`, `a`.`target_minggu`, `b`.`alias`, `a`.`tgl_ubah_progress`, `b`.`tgl_close`, `b`.`validasi_kapro`
FROM `progress_proyek` `a`
JOIN `master_pkp` `b` ON `a`.`id_pkp` = `b`.`id_pkp`
JOIN `master_instansi` `c` ON `b`.`id_instansi` = `c`.`id`
WHERE `a`.`akhir` = 'A'
AND `c`.`nomor` = '711'
ORDER BY `b`.`no_pkp` DESC
---

        if ((level_user('dashboard', 'index', $kategoriQNS, 'all') > 0) or (level_user('trans', '1', $kategoriQNS, 'read') > 0)) {

            $data['trans'] = $this->db->table("progress_proyek a")->select("a.tahun,a.bulan,a.alert,b.warning,b.late,b.proyek,a.id_pkp,a.bobot_pg,a.rensd_mgll,a.rilsd_mgll,a.devsd_mgll,a.ren_mgini,a.ril_mgini,a.dev_mgini,a.rensd_mgini,a.rilsd_mgini,a.devsd_mgini,a.sisa_bobotpg,a.tgl_mulai,a.tgl_selesai,a.sisa_waktu,a.target_minggu,b.alias,a.tgl_ubah_progress,b.tgl_close,b.validasi_kapro")->join('master_pkp b', 'a.id_pkp = b.id_pkp')->join('master_instansi c', 'b.id_instansi = c.id')->where('a.akhir', 'A')->where('c.nomor', '711')->orderBy('b.no_pkp', 'DESC')->get()->getResult();

SELECT `a`.`tahun`, `a`.`bulan`, `a`.`alert`, `b`.`warning`, `b`.`late`, `b`.`proyek`, `a`.`id_pkp`, `a`.`bobot_pg`, `a`.`rensd_mgll`, `a`.`rilsd_mgll`, `a`.`devsd_mgll`, `a`.`ren_mgini`, `a`.`ril_mgini`, `a`.`dev_mgini`, `a`.`rensd_mgini`, `a`.`rilsd_mgini`, `a`.`devsd_mgini`, `a`.`sisa_bobotpg`, `a`.`tgl_mulai`, `a`.`tgl_selesai`, `a`.`sisa_waktu`, `a`.`target_minggu`, `b`.`alias`, `a`.`tgl_ubah_progress`, `b`.`tgl_close`, `b`.`validasi_kapro`
FROM `progress_proyek` `a`
JOIN `master_pkp` `b` ON `a`.`id_pkp` = `b`.`id_pkp`
JOIN `master_instansi` `c` ON `b`.`id_instansi` = `c`.`id`
WHERE `a`.`akhir` = 'A'
AND `c`.`nomor` = '711'
ORDER BY `b`.`no_pkp` DESC
---

        if ((level_user('dashboard', 'index', $kategoriQNS, 'all') > 0) or (level_user('trans', '1', $kategoriQNS, 'read') > 0)) {

            $data['trans'] = $this->db->table("progress_proyek a")->select("a.tahun,a.bulan,a.alert,b.warning,b.late,b.proyek,a.id_pkp,a.bobot_pg,a.rensd_mgll,a.rilsd_mgll,a.devsd_mgll,a.ren_mgini,a.ril_mgini,a.dev_mgini,a.rensd_mgini,a.rilsd_mgini,a.devsd_mgini,a.sisa_bobotpg,a.tgl_mulai,a.tgl_selesai,a.sisa_waktu,a.target_minggu,b.alias,a.tgl_ubah_progress,b.tgl_close,b.validasi_kapro")->join('master_pkp b', 'a.id_pkp = b.id_pkp')->join('master_instansi c', 'b.id_instansi = c.id')->where('a.akhir', 'A')->where('c.nomor', '711')->orderBy('b.no_pkp', 'DESC')->get()->getResult();

SELECT `a`.`tahun`, `a`.`bulan`, `a`.`alert`, `b`.`warning`, `b`.`late`, `b`.`proyek`, `a`.`id_pkp`, `a`.`bobot_pg`, `a`.`rensd_mgll`, `a`.`rilsd_mgll`, `a`.`devsd_mgll`, `a`.`ren_mgini`, `a`.`ril_mgini`, `a`.`dev_mgini`, `a`.`rensd_mgini`, `a`.`rilsd_mgini`, `a`.`devsd_mgini`, `a`.`sisa_bobotpg`, `a`.`tgl_mulai`, `a`.`tgl_selesai`, `a`.`sisa_waktu`, `a`.`target_minggu`, `b`.`alias`, `a`.`tgl_ubah_progress`, `b`.`tgl_close`, `b`.`validasi_kapro`
FROM `progress_proyek` `a`
JOIN `master_pkp` `b` ON `a`.`id_pkp` = `b`.`id_pkp`
JOIN `master_instansi` `c` ON `b`.`id_instansi` = `c`.`id`
WHERE `a`.`akhir` = 'A'
AND `c`.`nomor` = '712'
ORDER BY `b`.`no_pkp` DESC
---

        if ((level_user('dashboard', 'index', $kategoriQNS, 'all') > 0) or (level_user('trans', '2', $kategoriQNS, 'read') > 0)) {

            $data['trans2'] = $this->db->table("progress_proyek a")->select("a.tahun,a.bulan,a.alert,b.warning,b.late,b.proyek,a.id_pkp,a.bobot_pg,a.rensd_mgll,a.rilsd_mgll,a.devsd_mgll,a.ren_mgini,a.ril_mgini,a.dev_mgini,a.rensd_mgini,a.rilsd_mgini,a.devsd_mgini,a.sisa_bobotpg,a.tgl_mulai,a.tgl_selesai,a.sisa_waktu,a.target_minggu,b.alias,a.tgl_ubah_progress,b.tgl_close,b.validasi_kapro")->join('master_pkp b', 'a.id_pkp = b.id_pkp')->join('master_instansi c', 'b.id_instansi = c.id')->where('a.akhir', 'A')->where('c.nomor', '712')->orderBy('b.no_pkp', 'DESC')->get()->getResult();

SELECT `b`.`nomor`, `a`.`no_pkp`, `a`.`alias`, `a`.`proyek`, `a`.`tgl_mulai`, `a`.`tgl_selesai`, `a`.`nilai_jaminan`, `a`.`tgl_jaminan`, `a`.`bast_1`, `a`.`bast_2`, `a`.`referensi`, `a`.`id_pkp`
FROM `master_pkp` `a`
JOIN `master_instansi` `b` ON `a`.`id_instansi` = `b`.`id`
WHERE `a`.`tgl_ubah_progress` > '2010-01-01'
ORDER BY `b`.`nomor`, `a`.`no_pkp` DESC
---
            }
        }
        if ((level_user('dashboard', 'index', $kategoriQNS, 'all') > 0) or (level_user('dashboard', 'index', $kategoriQNS, 'divisi') > 0 and $no_divisi == '412')) {
            $data['marketing'] = $this->db->table('master_pkp a')->select("b.nomor,a.no_pkp,a.alias,a.proyek,a.tgl_mulai,a.tgl_selesai,a.nilai_jaminan,a.tgl_jaminan,a.bast_1,a.bast_2,a.referensi,a.id_pkp")->join('master_instansi b', 'a.id_instansi = b.id')->where('a.tgl_ubah_progress >', '2010-01-01')->orderBy('b.nomor')->orderBy('a.no_pkp', 'DESC')->get()->getResult();

SELECT *
FROM `master_admin`
WHERE `id` = 'USRdbc1087b5a6676dba1c7336a94e85fa3e0ba282dQNS'
 LIMIT 1
SELECT *
FROM `master_pkp`
WHERE `id_pkp` = 'PKP9d6e048e64d5d208a2f99c15ddfcb2a9d7035384QNS'
 LIMIT 1
SELECT *
FROM `master_instansi`
WHERE `id` = 'INSe5a9283226f5c5d3adc6bc27f6fcdb87b15005bdQNS'
 LIMIT 1
SELECT `a`.`tahun`, `a`.`bulan`, `a`.`alert`, `b`.`warning`, `b`.`late`, `b`.`proyek`, `a`.`id_pkp`, `a`.`bobot_pg`, `a`.`rensd_mgll`, `a`.`rilsd_mgll`, `a`.`devsd_mgll`, `a`.`ren_mgini`, `a`.`ril_mgini`, `a`.`dev_mgini`, `a`.`rensd_mgini`, `a`.`rilsd_mgini`, `a`.`devsd_mgini`, `a`.`sisa_bobotpg`, `a`.`tgl_mulai`, `a`.`tgl_selesai`, `a`.`sisa_waktu`, `a`.`target_minggu`, `b`.`alias`, `a`.`tgl_ubah_progress`, `b`.`tgl_close`, `b`.`validasi_kapro`
FROM `progress_proyek` `a`
JOIN `master_pkp` `b` ON `a`.`id_pkp` = `b`.`id_pkp`
JOIN `master_instansi` `c` ON `b`.`id_instansi` = `c`.`id`
WHERE `a`.`akhir` = 'A'
AND `c`.`nomor` = '511'
ORDER BY `b`.`no_pkp` DESC
---
    public function beranda_02()
    {
        $data['kode'] = '01';
        $data['judul'] = 'MAIN DASHBOARD';
        date_default_timezone_set("Asia/Jakarta");
        $now = date("Y-m-d");
        $tgl_terawan = date('Y-m-d', strtotime('-365 days', strtotime($now)));

        $idQNS = session('idadmin');
        $isi = $this->db->table("master_admin")->where('id', $idQNS, 1)->get()->getRow();
        $kategoriQNS = $isi->kategori_user;
        $id_pkp2 = $isi->pkp_user;
        $username = $isi->username;
        $proyek = $this->db->table('master_admin')->getWhere(['id' => $idQNS], 1);
        $pkp_user = $proyek->getRow()->pkp_user;


        if ($pkp_user != '') {
            $divisi = $this->db->table('master_pkp')->getWhere(['id_pkp' => $pkp_user], 1);
            $id_divisi = $divisi->getRow()->id_instansi;
            $div = $this->db->table('master_instansi')->getWhere(['id' => $id_divisi], 1);
            $no_divisi = $div->getRow()->nomor;
        }

        if (!level_user('dashboard', 'index', $kategoriQNS, 'read') > 0) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        if ((level_user('dashboard', 'index', $kategoriQNS, 'all') > 0) or (level_user('gedung', '1', $kategoriQNS, 'read') > 0)) {
            $data['proyek1'] = $this->db->table("progress_proyek a")->select("a.tahun,a.bulan,a.alert,b.warning,b.late,b.proyek,a.id_pkp,a.bobot_pg,a.rensd_mgll,a.rilsd_mgll,a.devsd_mgll,a.ren_mgini,a.ril_mgini,a.dev_mgini,a.rensd_mgini,a.rilsd_mgini,a.devsd_mgini,a.sisa_bobotpg,a.tgl_mulai,a.tgl_selesai,a.sisa_waktu,a.target_minggu,b.alias,a.tgl_ubah_progress,b.tgl_close,b.validasi_kapro")->join('master_pkp b', 'a.id_pkp = b.id_pkp')->join('master_instansi c', 'b.id_instansi = c.id')->where('a.akhir', 'A')->where('c.nomor', '511')->orderBy('b.no_pkp', 'DESC')->get()->getResult();

SELECT `a`.`tahun`, `a`.`bulan`, `a`.`alert`, `b`.`warning`, `b`.`late`, `b`.`proyek`, `a`.`id_pkp`, `a`.`bobot_pg`, `a`.`rensd_mgll`, `a`.`rilsd_mgll`, `a`.`devsd_mgll`, `a`.`ren_mgini`, `a`.`ril_mgini`, `a`.`dev_mgini`, `a`.`rensd_mgini`, `a`.`rilsd_mgini`, `a`.`devsd_mgini`, `a`.`sisa_bobotpg`, `a`.`tgl_mulai`, `a`.`tgl_selesai`, `a`.`sisa_waktu`, `a`.`target_minggu`, `b`.`alias`, `a`.`tgl_ubah_progress`, `b`.`tgl_close`, `b`.`validasi_kapro`
FROM `progress_proyek` `a`
JOIN `master_pkp` `b` ON `a`.`id_pkp` = `b`.`id_pkp`
JOIN `master_instansi` `c` ON `b`.`id_instansi` = `c`.`id`
WHERE `a`.`akhir` = 'A'
AND `c`.`nomor` = '512'
ORDER BY `b`.`no_pkp` DESC
---

        if ((level_user('dashboard', 'index', $kategoriQNS, 'all') > 0) or (level_user('gedung', '2', $kategoriQNS, 'read') > 0) /*or ($username == '10288')*/) {

            $data['proyek2'] = $this->db->table("progress_proyek a")->select("a.tahun,a.bulan,a.alert,b.warning,b.late,b.proyek,a.id_pkp,a.bobot_pg,a.rensd_mgll,a.rilsd_mgll,a.devsd_mgll,a.ren_mgini,a.ril_mgini,a.dev_mgini,a.rensd_mgini,a.rilsd_mgini,a.devsd_mgini,a.sisa_bobotpg,a.tgl_mulai,a.tgl_selesai,a.sisa_waktu,a.target_minggu,b.alias,a.tgl_ubah_progress,b.tgl_close,b.validasi_kapro")->join('master_pkp b', 'a.id_pkp = b.id_pkp')->join('master_instansi c', 'b.id_instansi = c.id')->where('a.akhir', 'A')->where('c.nomor', '512')->orderBy('b.no_pkp', 'DESC')->get()->getResult();

SELECT `a`.`tahun`, `a`.`bulan`, `a`.`alert`, `b`.`warning`, `b`.`late`, `b`.`proyek`, `a`.`id_pkp`, `a`.`bobot_pg`, `a`.`rensd_mgll`, `a`.`rilsd_mgll`, `a`.`devsd_mgll`, `a`.`ren_mgini`, `a`.`ril_mgini`, `a`.`dev_mgini`, `a`.`rensd_mgini`, `a`.`rilsd_mgini`, `a`.`devsd_mgini`, `a`.`sisa_bobotpg`, `a`.`tgl_mulai`, `a`.`tgl_selesai`, `a`.`sisa_waktu`, `a`.`target_minggu`, `b`.`alias`, `a`.`tgl_ubah_progress`, `b`.`tgl_close`, `b`.`validasi_kapro`
FROM `progress_proyek` `a`
JOIN `master_pkp` `b` ON `a`.`id_pkp` = `b`.`id_pkp`
JOIN `master_instansi` `c` ON `b`.`id_instansi` = `c`.`id`
WHERE `a`.`akhir` = 'A'
AND `c`.`nomor` = '611'
ORDER BY `b`.`no_pkp` DESC
---

        if ((level_user('dashboard', 'index', $kategoriQNS, 'all') > 0) or (level_user('ktl', '1', $kategoriQNS, 'read') > 0)) {

            $data['ktl'] = $this->db->table("progress_proyek a")->select("a.tahun,a.bulan,a.alert,b.warning,b.late,b.proyek,a.id_pkp,a.bobot_pg,a.rensd_mgll,a.rilsd_mgll,a.devsd_mgll,a.ren_mgini,a.ril_mgini,a.dev_mgini,a.rensd_mgini,a.rilsd_mgini,a.devsd_mgini,a.sisa_bobotpg,a.tgl_mulai,a.tgl_selesai,a.sisa_waktu,a.target_minggu,b.alias,a.tgl_ubah_progress,b.tgl_close,b.validasi_kapro")->join('master_pkp b', 'a.id_pkp = b.id_pkp')->join('master_instansi c', 'b.id_instansi = c.id')->where('a.akhir', 'A')->where('c.nomor', '611')->orderBy('b.no_pkp', 'DESC')->get()->getResult();

SELECT `a`.`tahun`, `a`.`bulan`, `a`.`alert`, `b`.`warning`, `b`.`late`, `b`.`proyek`, `a`.`id_pkp`, `a`.`bobot_pg`, `a`.`rensd_mgll`, `a`.`rilsd_mgll`, `a`.`devsd_mgll`, `a`.`ren_mgini`, `a`.`ril_mgini`, `a`.`dev_mgini`, `a`.`rensd_mgini`, `a`.`rilsd_mgini`, `a`.`devsd_mgini`, `a`.`sisa_bobotpg`, `a`.`tgl_mulai`, `a`.`tgl_selesai`, `a`.`sisa_waktu`, `a`.`target_minggu`, `b`.`alias`, `a`.`tgl_ubah_progress`, `b`.`tgl_close`, `b`.`validasi_kapro`
FROM `progress_proyek` `a`
JOIN `master_pkp` `b` ON `a`.`id_pkp` = `b`.`id_pkp`
JOIN `master_instansi` `c` ON `b`.`id_instansi` = `c`.`id`
WHERE `a`.`akhir` = 'A'
AND `c`.`nomor` = '612'
ORDER BY `b`.`no_pkp` DESC
---

        if ((level_user('dashboard', 'index', $kategoriQNS, 'all') > 0) or (level_user('ktl', '2', $kategoriQNS, 'read') > 0)) {

            $data['ktl2'] = $this->db->table("progress_proyek a")->select("a.tahun,a.bulan,a.alert,b.warning,b.late,b.proyek,a.id_pkp,a.bobot_pg,a.rensd_mgll,a.rilsd_mgll,a.devsd_mgll,a.ren_mgini,a.ril_mgini,a.dev_mgini,a.rensd_mgini,a.rilsd_mgini,a.devsd_mgini,a.sisa_bobotpg,a.tgl_mulai,a.tgl_selesai,a.sisa_waktu,a.target_minggu,b.alias,a.tgl_ubah_progress,b.tgl_close,b.validasi_kapro")->join('master_pkp b', 'a.id_pkp = b.id_pkp')->join('master_instansi c', 'b.id_instansi = c.id')->where('a.akhir', 'A')->where('c.nomor', '612')->orderBy('b.no_pkp', 'DESC')->get()->getResult();

SELECT `a`.`tahun`, `a`.`bulan`, `a`.`alert`, `b`.`warning`, `b`.`late`, `b`.`proyek`, `a`.`id_pkp`, `a`.`bobot_pg`, `a`.`rensd_mgll`, `a`.`rilsd_mgll`, `a`.`devsd_mgll`, `a`.`ren_mgini`, `a`.`ril_mgini`, `a`.`dev_mgini`, `a`.`rensd_mgini`, `a`.`rilsd_mgini`, `a`.`devsd_mgini`, `a`.`sisa_bobotpg`, `a`.`tgl_mulai`, `a`.`tgl_selesai`, `a`.`sisa_waktu`, `a`.`target_minggu`, `b`.`alias`, `a`.`tgl_ubah_progress`, `b`.`tgl_close`, `b`.`validasi_kapro`
FROM `progress_proyek` `a`
JOIN `master_pkp` `b` ON `a`.`id_pkp` = `b`.`id_pkp`
JOIN `master_instansi` `c` ON `b`.`id_instansi` = `c`.`id`
WHERE `a`.`akhir` = 'A'
AND `c`.`nomor` = '711'
ORDER BY `b`.`no_pkp` DESC
---

        if ((level_user('dashboard', 'index', $kategoriQNS, 'all') > 0) or (level_user('trans', '1', $kategoriQNS, 'read') > 0)) {

            $data['trans'] = $this->db->table("progress_proyek a")->select("a.tahun,a.bulan,a.alert,b.warning,b.late,b.proyek,a.id_pkp,a.bobot_pg,a.rensd_mgll,a.rilsd_mgll,a.devsd_mgll,a.ren_mgini,a.ril_mgini,a.dev_mgini,a.rensd_mgini,a.rilsd_mgini,a.devsd_mgini,a.sisa_bobotpg,a.tgl_mulai,a.tgl_selesai,a.sisa_waktu,a.target_minggu,b.alias,a.tgl_ubah_progress,b.tgl_close,b.validasi_kapro")->join('master_pkp b', 'a.id_pkp = b.id_pkp')->join('master_instansi c', 'b.id_instansi = c.id')->where('a.akhir', 'A')->where('c.nomor', '711')->orderBy('b.no_pkp', 'DESC')->get()->getResult();

SELECT `a`.`tahun`, `a`.`bulan`, `a`.`alert`, `b`.`warning`, `b`.`late`, `b`.`proyek`, `a`.`id_pkp`, `a`.`bobot_pg`, `a`.`rensd_mgll`, `a`.`rilsd_mgll`, `a`.`devsd_mgll`, `a`.`ren_mgini`, `a`.`ril_mgini`, `a`.`dev_mgini`, `a`.`rensd_mgini`, `a`.`rilsd_mgini`, `a`.`devsd_mgini`, `a`.`sisa_bobotpg`, `a`.`tgl_mulai`, `a`.`tgl_selesai`, `a`.`sisa_waktu`, `a`.`target_minggu`, `b`.`alias`, `a`.`tgl_ubah_progress`, `b`.`tgl_close`, `b`.`validasi_kapro`
FROM `progress_proyek` `a`
JOIN `master_pkp` `b` ON `a`.`id_pkp` = `b`.`id_pkp`
JOIN `master_instansi` `c` ON `b`.`id_instansi` = `c`.`id`
WHERE `a`.`akhir` = 'A'
AND `c`.`nomor` = '711'
ORDER BY `b`.`no_pkp` DESC
---

        if ((level_user('dashboard', 'index', $kategoriQNS, 'all') > 0) or (level_user('trans', '1', $kategoriQNS, 'read') > 0)) {

            $data['trans'] = $this->db->table("progress_proyek a")->select("a.tahun,a.bulan,a.alert,b.warning,b.late,b.proyek,a.id_pkp,a.bobot_pg,a.rensd_mgll,a.rilsd_mgll,a.devsd_mgll,a.ren_mgini,a.ril_mgini,a.dev_mgini,a.rensd_mgini,a.rilsd_mgini,a.devsd_mgini,a.sisa_bobotpg,a.tgl_mulai,a.tgl_selesai,a.sisa_waktu,a.target_minggu,b.alias,a.tgl_ubah_progress,b.tgl_close,b.validasi_kapro")->join('master_pkp b', 'a.id_pkp = b.id_pkp')->join('master_instansi c', 'b.id_instansi = c.id')->where('a.akhir', 'A')->where('c.nomor', '711')->orderBy('b.no_pkp', 'DESC')->get()->getResult();

SELECT `a`.`tahun`, `a`.`bulan`, `a`.`alert`, `b`.`warning`, `b`.`late`, `b`.`proyek`, `a`.`id_pkp`, `a`.`bobot_pg`, `a`.`rensd_mgll`, `a`.`rilsd_mgll`, `a`.`devsd_mgll`, `a`.`ren_mgini`, `a`.`ril_mgini`, `a`.`dev_mgini`, `a`.`rensd_mgini`, `a`.`rilsd_mgini`, `a`.`devsd_mgini`, `a`.`sisa_bobotpg`, `a`.`tgl_mulai`, `a`.`tgl_selesai`, `a`.`sisa_waktu`, `a`.`target_minggu`, `b`.`alias`, `a`.`tgl_ubah_progress`, `b`.`tgl_close`, `b`.`validasi_kapro`
FROM `progress_proyek` `a`
JOIN `master_pkp` `b` ON `a`.`id_pkp` = `b`.`id_pkp`
JOIN `master_instansi` `c` ON `b`.`id_instansi` = `c`.`id`
WHERE `a`.`akhir` = 'A'
AND `c`.`nomor` = '712'
ORDER BY `b`.`no_pkp` DESC
---

        if ((level_user('dashboard', 'index', $kategoriQNS, 'all') > 0) or (level_user('trans', '2', $kategoriQNS, 'read') > 0)) {

            $data['trans2'] = $this->db->table("progress_proyek a")->select("a.tahun,a.bulan,a.alert,b.warning,b.late,b.proyek,a.id_pkp,a.bobot_pg,a.rensd_mgll,a.rilsd_mgll,a.devsd_mgll,a.ren_mgini,a.ril_mgini,a.dev_mgini,a.rensd_mgini,a.rilsd_mgini,a.devsd_mgini,a.sisa_bobotpg,a.tgl_mulai,a.tgl_selesai,a.sisa_waktu,a.target_minggu,b.alias,a.tgl_ubah_progress,b.tgl_close,b.validasi_kapro")->join('master_pkp b', 'a.id_pkp = b.id_pkp')->join('master_instansi c', 'b.id_instansi = c.id')->where('a.akhir', 'A')->where('c.nomor', '712')->orderBy('b.no_pkp', 'DESC')->get()->getResult();

SELECT `b`.`nomor`, `a`.`no_pkp`, `a`.`alias`, `a`.`proyek`, `a`.`tgl_mulai`, `a`.`tgl_selesai`, `a`.`nilai_jaminan`, `a`.`tgl_jaminan`, `a`.`bast_1`, `a`.`bast_2`, `a`.`referensi`, `a`.`id_pkp`
FROM `master_pkp` `a`
JOIN `master_instansi` `b` ON `a`.`id_instansi` = `b`.`id`
WHERE `a`.`tgl_ubah_progress` > '2010-01-01'
ORDER BY `b`.`nomor`, `a`.`no_pkp` DESC
---
            }
        }
        if ((level_user('dashboard', 'index', $kategoriQNS, 'all') > 0) or (level_user('dashboard', 'index', $kategoriQNS, 'divisi') > 0 and $no_divisi == '412')) {
            $data['marketing'] = $this->db->table('master_pkp a')->select("b.nomor,a.no_pkp,a.alias,a.proyek,a.tgl_mulai,a.tgl_selesai,a.nilai_jaminan,a.tgl_jaminan,a.bast_1,a.bast_2,a.referensi,a.id_pkp")->join('master_instansi b', 'a.id_instansi = b.id')->where('a.tgl_ubah_progress >', '2010-01-01')->orderBy('b.nomor')->orderBy('a.no_pkp', 'DESC')->get()->getResult();