app/Controllers/Data.php

SELECT *
FROM `master_admin`
WHERE `id` = 'USRdbc1087b5a6676dba1c7336a94e85fa3e0ba282dQNS'
---
    public function index()
    {
        $idQNS = session('idadmin');
        $isi = $this->db->table("master_admin")->where('id', $idQNS, 1)->get()->getRow();

SELECT *
FROM `master_admin`
WHERE `id` = 'USRdbc1087b5a6676dba1c7336a94e85fa3e0ba282dQNS'
SELECT *
FROM `master_instansi`
SELECT *
FROM `master_pkp`
WHERE `id_pkp` = 'PKPa2113939c967ab231d27916ec7874401d1b68604QNS'
 LIMIT 1
SELECT `b`.`nomor`
FROM `master_pkp` `a`
JOIN `master_instansi` `b` ON `a`.`id_instansi` = `b`.`id`
WHERE `a`.`id_pkp` = 'PKPa2113939c967ab231d27916ec7874401d1b68604QNS'
SELECT `b`.`nomor`, `b`.`alias`, `b`.`ling`
FROM `master_pkp` `a`
JOIN `master_instansi` `b` ON `a`.`id_instansi` = `b`.`id`
WHERE `a`.`id_pkp` = 'PKPa2113939c967ab231d27916ec7874401d1b68604QNS'
SELECT `a`.`kode_pt`, `b`.`proyek`, `a`.`paket`, `a`.`id_pkp`, `a`.`bobot_pg`, `a`.`rensd_mgll`, `a`.`rilsd_mgll`, `a`.`devsd_mgll`, `a`.`ren_mgini`, `a`.`ril_mgini`, `a`.`dev_mgini`, `a`.`rensd_mgini`, `a`.`rilsd_mgini`, `a`.`devsd_mgini`, `a`.`sisa_bobotpg`, `a`.`tgl_mulai`, `a`.`tgl_selesai`, `a`.`sisa_waktu`, `a`.`target_minggu`, `d`.`alias`
FROM `progress_paket` `a`
JOIN `master_pkp` `b` ON `a`.`id_pkp` = `b`.`id_pkp`
LEFT JOIN `pt_detil` `c` ON `a`.`id_pt` = `c`.`id`
LEFT JOIN `pt_master` `d` ON `c`.`id_pt` = `d`.`id`
WHERE `a`.`id_pkp` = 'PKPa2113939c967ab231d27916ec7874401d1b68604QNS'
AND `a`.`tahun` = '23'
AND `a`.`bulan` = '02'
ORDER BY `a`.`nomor`
SELECT `b`.`proyek`, `a`.`id_pkp`, `a`.`bobot_pg`, `a`.`rensd_mgll`, `a`.`rilsd_mgll`, `a`.`devsd_mgll`, `a`.`ren_mgini`, `a`.`ril_mgini`, `a`.`dev_mgini`, `a`.`rensd_mgini`, `a`.`rilsd_mgini`, `a`.`devsd_mgini`, `a`.`sisa_bobotpg`, `a`.`tgl_mulai`, `a`.`tgl_selesai`, `a`.`sisa_waktu`, `a`.`target_minggu`, `a`.`tgl_ubah_progress`
FROM `progress_proyek` `a`
JOIN `master_pkp` `b` ON `a`.`id_pkp` = `b`.`id_pkp`
WHERE `a`.`id_pkp` = 'PKPa2113939c967ab231d27916ec7874401d1b68604QNS'
AND `a`.`tahun` = '23'
AND `a`.`bulan` = '02'
SELECT *
FROM `progress_proyek`
WHERE `id_pkp` = 'PKPa2113939c967ab231d27916ec7874401d1b68604QNS'
SELECT *
FROM `dt_umum`
WHERE `pkp` = 'PKPa2113939c967ab231d27916ec7874401d1b68604QNS'
SELECT *
FROM `mon_dcr`
WHERE `type` = 'TOTAL'
AND `id_pkp` = 'PKPa2113939c967ab231d27916ec7874401d1b68604QNS'
AND `tgl_import` = '2023-02-10'
SELECT *
FROM `mon_dcr`
WHERE `type` != 'TOTAL'
AND `id_pkp` = 'PKPa2113939c967ab231d27916ec7874401d1b68604QNS'
SELECT *
FROM `mon_dcr`
WHERE `type` = 'TOTAL'
AND `id_pkp` = 'PKPa2113939c967ab231d27916ec7874401d1b68604QNS'
---
    public function mon_dcr_qs()
    {
        $data['kode'] = '03';
        $idQNS = session('idadmin');
        $isi = $this->db->table("master_admin")->where('id', $idQNS, 1)->get()->getRow();
        $kategoriQNS = $isi->kategori_user;
        $kode = 'PKPa2113939c967ab231d27916ec7874401d1b68604QNS';
        if (!level_user('qs', 'index', $kategoriQNS, 'read') > 0) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }
        $data['instansi'] = $this->db->table('master_instansi')->get()->getResult();

        $data['proyek'] = $this->db->table('master_pkp')->getWhere(['id_pkp' => $kode], 1);
        $tgl = $data['proyek']->getRow()->tgl_ubah_dcr;
        $tahun = substr($tgl, 2, 2);
        $bulan = substr($tgl, 5, 2);

        $data['instansiQN'] = $this->db->table("master_pkp a")->select("b.nomor")->join('master_instansi b', 'a.id_instansi = b.id')->where('a.id_pkp', $kode)->get();
        $data['nomorQN'] = $data['instansiQN']->getRow()->nomor;

        $data['instansi2'] = $this->db->table("master_pkp a")->select("b.nomor")->join('master_instansi b', 'a.id_instansi = b.id')->where('a.id_pkp', $kode)->get()->getResult();
        $data['instansi3'] = $this->db->table("master_pkp a")->select("b.nomor,b.alias,b.ling")->join('master_instansi b', 'a.id_instansi = b.id')->where('a.id_pkp', $kode)->get();

        $data['paket'] = $this->db->table("progress_paket a")->select("a.kode_pt,b.proyek,a.paket,a.id_pkp,a.bobot_pg,a.rensd_mgll,a.rilsd_mgll,a.devsd_mgll,a.ren_mgini,a.ril_mgini,a.dev_mgini,a.rensd_mgini,a.rilsd_mgini,a.devsd_mgini,a.sisa_bobotpg,a.tgl_mulai,a.tgl_selesai,a.sisa_waktu,a.target_minggu,d.alias")->join('master_pkp b', 'a.id_pkp = b.id_pkp')->join('pt_detil c', 'a.id_pt = c.id', 'left')->join('pt_master d', 'c.id_pt = d.id', 'left')->where('a.id_pkp', $kode)->where('a.tahun', $tahun)->where('a.bulan', $bulan)->orderBy("a.nomor", "ascd")->get()->getResult();

        $data['proyek2'] = $this->db->table("progress_proyek a")->select("b.proyek,a.id_pkp,a.bobot_pg,a.rensd_mgll,a.rilsd_mgll,a.devsd_mgll,a.ren_mgini,a.ril_mgini,a.dev_mgini,a.rensd_mgini,a.rilsd_mgini,a.devsd_mgini,a.sisa_bobotpg,a.tgl_mulai,a.tgl_selesai,a.sisa_waktu,a.target_minggu,a.tgl_ubah_progress")->join('master_pkp b', 'a.id_pkp = b.id_pkp')->where('a.id_pkp', $kode)->where('a.tahun', $tahun)->where('a.bulan', $bulan)->get()->getResult();

        $data['cek_pro'] = $this->db->table("progress_proyek")->where('id_pkp', $kode, 1)->get();

        $data['cek2'] = $this->db->table("dt_umum")->where('pkp', $kode, 1)->get();

        $data['mon_dcr1'] = $this->db->table("mon_dcr")->select("*")->where('type', 'TOTAL')->where('id_pkp', $kode)->where('tgl_import', $tgl)->get()->getResult();
        $data['mon_dcr2'] = $this->db->table("mon_dcr")->select("*")->where('type !=', 'TOTAL')->where('id_pkp', $kode)->get()->getResult();
        $data['mon_dcr1a'] = $this->db->table("mon_dcr")->select("*")->where('type', 'TOTAL')->where('id_pkp', $kode)->get();