app/Controllers/Login.php

                        'aksi' => $aksi,

                    ];
                    $this->log->insert($array);
---
INSERT INTO `log` (`id_log`, `kode`, `id_user`, `ip`, `host`, `tgl_log`, `jam_log`, `layar`, `aksi`) VALUES ('LOGdeb3daede0125d59a9c5855b5aac55d0862600d4QNS', '2401170000002', 'USRdbc1087b5a6676dba1c7336a94e85fa3e0ba282dQNS', '::1', 'Edge 120.0.0.0', '2024-01-17', '10:16:38', 'Log IN', 'Log IN')