app/Controllers/Proyek.php

SELECT *
FROM `master_admin`
WHERE `id` = 'USRdbc1087b5a6676dba1c7336a94e85fa3e0ba282dQNS'
---
    public function index()
    {
        $data['kode'] = '02';
        $data['judul'] = 'PROYEK';
        $idQNS = session('idadmin');
        $isi = $this->db
            ->table('master_admin')
            ->where('id', $idQNS, 1)
            ->get()
            ->getRow();

SELECT *
FROM `master_admin`
WHERE `id` = 'USRdbc1087b5a6676dba1c7336a94e85fa3e0ba282dQNS'
SELECT *
FROM `master_instansi`
SELECT *
FROM `master_pkp`
WHERE `id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
 LIMIT 1
SELECT `b`.`alias`
FROM `master_pkp` `a`
JOIN `master_instansi` `b` ON `a`.`id_instansi` = `b`.`id`
WHERE `id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
 LIMIT 1
SELECT `b`.`nomor`
FROM `master_pkp` `a`
JOIN `master_instansi` `b` ON `a`.`id_instansi` = `b`.`id`
WHERE `a`.`id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
SELECT `b`.`nomor`, `b`.`alias`, `b`.`ling`
FROM `master_pkp` `a`
JOIN `master_instansi` `b` ON `a`.`id_instansi` = `b`.`id`
WHERE `a`.`id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
SELECT MAX(`kode`) AS `kode`
FROM `progress_proyek`
WHERE `id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
SELECT *
FROM `progress_proyek`
WHERE `kode` = 'PPY2408-00029'
---
    public function edit_1($kode)
    {
        $data['id_pkp'] = $this->request->uri->getSegment(4);
        $id_pkp = $this->request->uri->getSegment(4);
        $data['kode'] = '02';

        $idQNS = session('idadmin');
        $isi = $this->db
            ->table('master_admin')
            ->where('id', $idQNS, 1)
            ->get()
            ->getRow();
        $kategoriQNS = $isi->kategori_user;
        if (!level_user('proyek', 'data', $kategoriQNS, 'read') > 0) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }
        $data['instansi'] = $this->db
            ->table('master_instansi')
            ->get()
            ->getResult();
        $data['breadcumb'] = $this->db
            ->table('master_pkp')
            ->getWhere(['id_pkp' => $kode], 1);
        $data['divisi'] = $this->db
            ->table('master_pkp a')
            ->select('b.alias')
            ->join('master_instansi b', 'a.id_instansi = b.id')
            ->getWhere(['id_pkp' => $kode], 1);
        $data['proyek'] = $this->db
            ->table('master_pkp')
            ->getWhere(['id_pkp' => $kode], 1);
        $tgl = $data['proyek']->getRow()->tgl_ubah_progress;
        $data['tahun'] = substr($tgl, 2, 2);
        $data['bulan'] = substr($tgl, 5, 2);
        $data['instansiQN'] = $this->db
            ->table('master_pkp a')
            ->select('b.nomor')
            ->join('master_instansi b', 'a.id_instansi = b.id')
            ->where('a.id_pkp', $kode)
            ->get();
        $data['nomorQN'] = $data['instansiQN']->getRow()->nomor;

        $data['instansi2'] = $this->db
            ->table('master_pkp a')
            ->select('b.nomor')
            ->join('master_instansi b', 'a.id_instansi = b.id')
            ->where('a.id_pkp', $kode)
            ->get()
            ->getResult();
        $data['instansi3'] = $this->db
            ->table('master_pkp a')
            ->select('b.nomor,b.alias,b.ling')
            ->join('master_instansi b', 'a.id_instansi = b.id')
            ->where('a.id_pkp', $kode)
            ->get();

        $data['proyek23'] = $this->db
            ->table('progress_proyek')
            ->selectMax('kode')
            ->where('id_pkp', $kode)
            ->get();
        $kode_proyek = $data['proyek23']->getRow()->kode;
        $data['proyek22'] = $this->db
            ->table('progress_proyek')
            ->getWhere(['kode' => $kode_proyek]);

SELECT *
FROM `progress_proyek`
WHERE `id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
SELECT *
FROM `dt_umum`
WHERE `pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
SELECT *
FROM `dt_umum`
WHERE `pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
ORDER BY `no_urut1`
SELECT `a`.`nomor`, `a`.`type`, `a`.`masalah`, `a`.`penyebab`, `a`.`dampak`, `a`.`solusi`, `a`.`pic`, `a`.`target`
FROM `solusi` `a`
JOIN `master_pkp` `b` ON `a`.`id_pkp` = `b`.`id_pkp`
WHERE `a`.`id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
AND `a`.`type` = 'EKS'
AND `a`.`id_solusi` = `b`.`id_solusi`
ORDER BY `a`.`nomor`
SELECT `a`.`nomor`, `a`.`type`, `a`.`masalah`, `a`.`penyebab`, `a`.`dampak`, `a`.`solusi`, `a`.`pic`, `a`.`target`
FROM `solusi` `a`
JOIN `master_pkp` `b` ON `a`.`id_pkp` = `b`.`id_pkp`
WHERE `a`.`id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
AND `a`.`type` = 'INT'
AND `a`.`id_solusi` = `b`.`id_solusi`
ORDER BY `a`.`nomor`
SELECT `a`.`gambar1`, `a`.`gambar2`, `a`.`gambar3`, `a`.`gambar4`, `a`.`gambar5`
FROM `gambar` `a`
JOIN `master_pkp` `b` ON `a`.`id_pkp` = `b`.`id_pkp`
WHERE `a`.`id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
AND `a`.`tgl_ubah` = `b`.`tgl_ubah_gbr`
ORDER BY `a`.`kode` DESC
SELECT `a`.`ket1`, `a`.`ket2`, `a`.`ket3`, `a`.`ket4`, `a`.`ket5`, `a`.`ket6`, `a`.`ket7`, `a`.`ket8`, `a`.`ket9`, `a`.`ket10`, `a`.`ket11`, `a`.`ket12`, `a`.`ket13`, `a`.`ket14`, `a`.`ket15`, `a`.`ket16`, `a`.`ket17`, `a`.`ket18`, `a`.`ket19`, `a`.`ket20`, `a`.`ket21`
FROM `dcr` `a`
JOIN `master_pkp` `b` ON `a`.`id_pkp` = `b`.`id_pkp`
WHERE `a`.`id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
AND `a`.`id_dcr` = `b`.`id_dcr`
SELECT `a`.`pdf1`, `a`.`pdf2`, `a`.`pdf3`, `a`.`pdf4`, `a`.`pdf5`, `a`.`pdf6`, `a`.`pdf7`, `a`.`pdf8`, `a`.`pdf9`, `a`.`pdf10`
FROM `pdf` `a`
JOIN `master_pkp` `b` ON `a`.`id_pkp` = `b`.`id_pkp`
WHERE `a`.`id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
AND `a`.`tgl_ubah` = `b`.`tgl_ubah_dtt`
---
            $id_progress_proyek = '';
        }

        $data['cek_pro'] = $this->db
            ->table('progress_proyek')
            ->where('id_pkp', $kode, 1)
            ->get();

        $data['cek2'] = $this->db
            ->table('dt_umum')
            ->where('pkp', $kode, 1)
            ->get();

        $data['dt_umum'] = $this->db
            ->table('dt_umum')
            ->select('*')
            ->where('pkp', $kode)
            ->orderBy('no_urut1', 'ascd')
            ->get()
            ->getResult();

        $data['solusi'] = $this->db
            ->table('solusi a')
            ->select(
                'a.nomor,a.type,a.masalah,a.penyebab,a.dampak,a.solusi,a.pic,a.target'
            )
            ->join('master_pkp b', 'a.id_pkp = b.id_pkp')
            ->where('a.id_pkp', $kode)
            ->where('a.type', 'EKS')
            ->where('a.id_solusi = b.id_solusi')
            ->orderBy('a.nomor', 'ascd')
            ->get()
            ->getResult();

        $data['solusi2'] = $this->db
            ->table('solusi a')
            ->select(
                'a.nomor,a.type,a.masalah,a.penyebab,a.dampak,a.solusi,a.pic,a.target'
            )
            ->join('master_pkp b', 'a.id_pkp = b.id_pkp')
            ->where('a.id_pkp', $kode)
            ->where('a.type', 'INT')
            ->where('a.id_solusi = b.id_solusi')
            ->orderBy('a.nomor', 'ascd')
            ->get()
            ->getResult();

        $data['gambar'] = $this->db
            ->table('gambar a')
            ->select('a.gambar1,a.gambar2,a.gambar3,a.gambar4,a.gambar5')
            ->join('master_pkp b', 'a.id_pkp = b.id_pkp')
            ->where('a.id_pkp', $kode)
            ->where('a.tgl_ubah = b.tgl_ubah_gbr')
            ->orderBy('a.kode', 'desc')
            ->get();

        $data['dcr'] = $this->db
            ->table('dcr a')
            ->select(
                'a.ket1,a.ket2,a.ket3,a.ket4,a.ket5,a.ket6,a.ket7,a.ket8,a.ket9,a.ket10,a.ket11,a.ket12,a.ket13,a.ket14,a.ket15,a.ket16,a.ket17,a.ket18,a.ket19,a.ket20,a.ket21'
            )
            ->join('master_pkp b', 'a.id_pkp = b.id_pkp')
            ->where('a.id_pkp', $kode)
            ->where('a.id_dcr = b.id_dcr')
            ->get()
            ->getResult();

        $data['pdf'] = $this->db
            ->table('pdf a')
            ->select(
                'a.pdf1,a.pdf2,a.pdf3,a.pdf4,a.pdf5,a.pdf6,a.pdf7,a.pdf8,a.pdf9,a.pdf10'
            )
            ->join('master_pkp b', 'a.id_pkp = b.id_pkp')
            ->where('a.id_pkp', $kode)
            ->where('a.tgl_ubah = b.tgl_ubah_dtt')
            ->get();

SELECT `a`.`tahun`, `a`.`tgl_sadd`, `a`.`tgl_fadd`, `a`.`bulan`, `a`.`kode_pt`, `b`.`proyek`, `a`.`paket`, `a`.`id_pkp`, `a`.`bobot_pg`, `a`.`rensd_mgll`, `a`.`rilsd_mgll`, `a`.`devsd_mgll`, `a`.`ren_mgini`, `a`.`ril_mgini`, `a`.`dev_mgini`, `a`.`rensd_mgini`, `a`.`rilsd_mgini`, `a`.`devsd_mgini`, `a`.`sisa_bobotpg`, `a`.`tgl_mulai`, `a`.`tgl_selesai`, `a`.`sisa_waktu`, `a`.`target_minggu`, `d`.`alias`, `a`.`keterangan`
FROM `progress_paket` `a`
JOIN `master_pkp` `b` ON `a`.`id_pkp` = `b`.`id_pkp`
LEFT JOIN `pt_detil` `c` ON `a`.`id_pt` = `c`.`id`
LEFT JOIN `pt_master` `d` ON `c`.`id_pt` = `d`.`id`
WHERE `a`.`progress_proyek` = 'PPY52bb8497c8bef3cf127911e4687e724bd5d1ad06QNS'
ORDER BY `a`.`nomor`
SELECT `a`.`bulan`, `a`.`tahun`, `b`.`proyek`, `a`.`id_pkp`, `a`.`bobot_pg`, `a`.`rensd_mgll`, `a`.`rilsd_mgll`, `a`.`devsd_mgll`, `a`.`ren_mgini`, `a`.`ril_mgini`, `a`.`dev_mgini`, `a`.`rensd_mgini`, `a`.`rilsd_mgini`, `a`.`devsd_mgini`, `a`.`sisa_bobotpg`, `a`.`tgl_mulai`, `a`.`tgl_selesai`, `a`.`sisa_waktu`, `a`.`target_minggu`, `a`.`tgl_ubah_progress`
FROM `progress_proyek` `a`
JOIN `master_pkp` `b` ON `a`.`id_pkp` = `b`.`id_pkp`
WHERE `a`.`id_pkp` = ''
AND `a`.`id` = 'PPY52bb8497c8bef3cf127911e4687e724bd5d1ad06QNS'
---
        $tahun = $this->request->getGet('tahun') ?? '00';

        if ($bulan === '00' && $tahun === '00') {
            $data['paket'] = $this->db
                ->table('progress_paket a')
                ->select(
                    'a.tahun,a.tgl_sadd,a.tgl_fadd,a.bulan,a.kode_pt,b.proyek,a.paket,a.id_pkp,a.bobot_pg,a.rensd_mgll,a.rilsd_mgll,a.devsd_mgll,a.ren_mgini,a.ril_mgini,a.dev_mgini,a.rensd_mgini,a.rilsd_mgini,a.devsd_mgini,a.sisa_bobotpg,a.tgl_mulai,a.tgl_selesai,a.sisa_waktu,a.target_minggu,d.alias,a.keterangan'
                )
                ->join('master_pkp b', 'a.id_pkp = b.id_pkp')
                ->join('pt_detil c', 'a.id_pt = c.id', 'left')
                ->join('pt_master d', 'c.id_pt = d.id', 'left')
                ->where('a.progress_proyek', $id_progress_proyek)
                ->orderBy('a.nomor', 'ascd')
                ->get()
                ->getResult();

            $data['proyek2'] = $this->db
                ->table('progress_proyek a')
                ->select(
                    'a.bulan,a.tahun,b.proyek,a.id_pkp,a.bobot_pg,a.rensd_mgll,a.rilsd_mgll,a.devsd_mgll,a.ren_mgini,a.ril_mgini,a.dev_mgini,a.rensd_mgini,a.rilsd_mgini,a.devsd_mgini,a.sisa_bobotpg,a.tgl_mulai,a.tgl_selesai,a.sisa_waktu,a.target_minggu,a.tgl_ubah_progress'
                )
                ->join('master_pkp b', 'a.id_pkp = b.id_pkp')
                ->where('a.id_pkp', $id_pkp)
                ->where('a.id', $id_progress_proyek)
                ->get()
                ->getResult();

SELECT `b`.`nomor`, `a`.`no_pkp`, `a`.`alias`, `a`.`proyek`, `a`.`tgl_mulai`, `a`.`tgl_selesai`, `a`.`nilai_jaminan`, `a`.`tgl_jaminan`, `a`.`bast_1`, `a`.`bast_2`, `a`.`referensi`, `a`.`id_pkp`
FROM `master_pkp` `a`
JOIN `master_instansi` `b` ON `a`.`id_instansi` = `b`.`id`
WHERE `a`.`tgl_ubah_progress` > '2010-01-01'
ORDER BY `b`.`nomor`, `a`.`no_pkp` DESC
SELECT *
FROM `addendum`
WHERE `id_marketing` = 'PKP0a381bdd8def59f77afcb6c8c6d235e08020b3b9QNS'
---
        $data['$id_progress_proyek'] = $id_progress_proyek;
        // $data['proyek2'] = $this->db->table("progress_proyek a")->select("a.bulan,a.tahun,b.proyek,a.id_pkp,a.bobot_pg,a.rensd_mgll,a.rilsd_mgll,a.devsd_mgll,a.ren_mgini,a.ril_mgini,a.dev_mgini,a.rensd_mgini,a.rilsd_mgini,a.devsd_mgini,a.sisa_bobotpg,a.tgl_mulai,a.tgl_selesai,a.sisa_waktu,a.target_minggu,a.tgl_ubah_progress")->join('master_pkp b', 'a.id_pkp = b.id_pkp')->where('a.id', $id_progress_proyek)->get()->getResult();
        // ;
        $data['marketing'] = $this->db
            ->table('master_pkp a')
            ->select(
                'b.nomor,a.no_pkp,a.alias,a.proyek,a.tgl_mulai,a.tgl_selesai,a.nilai_jaminan,a.tgl_jaminan,a.bast_1,a.bast_2,a.referensi,a.id_pkp'
            )
            ->join('master_instansi b', 'a.id_instansi = b.id')
            ->where('a.tgl_ubah_progress >', '2010-01-01')
            ->orderBy('b.nomor')
            ->orderBy('a.no_pkp', 'DESC')
            ->get()
            ->getResult();
        $marketing = $this->db
            ->table('master_pkp a')
            ->select(
                'b.nomor,a.no_pkp,a.alias,a.proyek,a.tgl_mulai,a.tgl_selesai,a.nilai_jaminan,a.tgl_jaminan,a.bast_1,a.bast_2,a.referensi,a.id_pkp'
            )
            ->join('master_instansi b', 'a.id_instansi = b.id')
            ->where('a.tgl_ubah_progress >', '2010-01-01')
            ->orderBy('b.nomor')
            ->orderBy('a.no_pkp', 'DESC')
            ->get()
            ->getRow();

        if ($marketing) {
            $id_pkp = $marketing->id_pkp;
            $QNS0 = $this->db
                ->table('addendum')
                ->select('*')
                ->where('id_marketing', $id_pkp)
                ->get();

SELECT *
FROM `master_pkp`
WHERE `id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
 LIMIT 1
SELECT `b`.`alias`
FROM `master_pkp` `a`
JOIN `master_instansi` `b` ON `a`.`id_instansi` = `b`.`id`
WHERE `id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
 LIMIT 1
SELECT *
FROM `master_admin`
WHERE `id` = 'USRdbc1087b5a6676dba1c7336a94e85fa3e0ba282dQNS'
SELECT *
FROM `master_instansi`
---
    public function edit_2($kode)
    {
        $id_pkp = $this->request->uri->getSegment(4);
        $data['kode'] = '02';
        $data['id_pkp'] = $this->request->uri->getSegment(4);
        $data['breadcumb'] = $this->db
            ->table('master_pkp')
            ->getWhere(['id_pkp' => $kode], 1);
        $data['divisi'] = $this->db
            ->table('master_pkp a')
            ->select('b.alias')
            ->join('master_instansi b', 'a.id_instansi = b.id')
            ->getWhere(['id_pkp' => $kode], 1);
        $idQNS = session('idadmin');
        $isi = $this->db
            ->table('master_admin')
            ->where('id', $idQNS, 1)
            ->get()
            ->getRow();
        $kategoriQNS = $isi->kategori_user;
        if (!level_user('proyek', 'data', $kategoriQNS, 'read') > 0) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }
        $data['instansi'] = $this->db
            ->table('master_instansi')
            ->get()
            ->getResult();

        $data['proyek'] = $this->db
            ->table('master_pkp')
            ->getWhere(['id_pkp' => $kode], 1);

SELECT `b`.`nomor`
FROM `master_pkp` `a`
JOIN `master_instansi` `b` ON `a`.`id_instansi` = `b`.`id`
WHERE `a`.`id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
SELECT `b`.`nomor`, `b`.`alias`, `b`.`ling`
FROM `master_pkp` `a`
JOIN `master_instansi` `b` ON `a`.`id_instansi` = `b`.`id`
WHERE `a`.`id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
SELECT *
FROM `progress_proyek`
WHERE `id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
SELECT *
FROM `dt_umum`
WHERE `pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
SELECT *
FROM `dt_umum`
WHERE `pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
ORDER BY `no_urut1`
---
        $data['tahun'] = substr($tgl, 2, 2);
        $data['bulan'] = substr($tgl, 5, 2);

        $data['instansiQN'] = $this->db
            ->table('master_pkp a')
            ->select('b.nomor')
            ->join('master_instansi b', 'a.id_instansi = b.id')
            ->where('a.id_pkp', $kode)
            ->get();
        $data['nomorQN'] = $data['instansiQN']->getRow()->nomor;
        $data['option_tahun'] = $this->proyek->option_tahun_msl($id_pkp);
        $data['instansi2'] = $this->db
            ->table('master_pkp a')
            ->select('b.nomor')
            ->join('master_instansi b', 'a.id_instansi = b.id')
            ->where('a.id_pkp', $kode)
            ->get();
        $data['instansi3'] = $this->db
            ->table('master_pkp a')
            ->select('b.nomor,b.alias,b.ling')
            ->join('master_instansi b', 'a.id_instansi = b.id')
            ->where('a.id_pkp', $kode)
            ->get();

        $data['cek_pro'] = $this->db
            ->table('progress_proyek')
            ->where('id_pkp', $kode, 1)
            ->get();

        $data['cek2'] = $this->db
            ->table('dt_umum')
            ->where('pkp', $kode, 1)
            ->get();

        $data['dt_umum'] = $this->db
            ->table('dt_umum')
            ->select('*')
            ->where('pkp', $kode)
            ->orderBy('no_urut1', 'ascd')
            ->get()
            ->getResult();

SELECT `a`.`nomor`, `a`.`type`, `a`.`masalah`, `a`.`penyebab`, `a`.`dampak`, `a`.`solusi`, `a`.`pic`, `a`.`target`, `a`.`nama_kontraktor`, `a`.`nama_paket`, `a`.`status`
FROM `solusi` `a`
JOIN `master_pkp` `b` ON `a`.`id_pkp` = `b`.`id_pkp`
WHERE `a`.`id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
AND `a`.`type` = 'EKS'
AND `a`.`id_solusi` = `b`.`id_solusi`
ORDER BY `a`.`nomor`
SELECT `a`.`nomor`, `a`.`type`, `a`.`masalah`, `a`.`penyebab`, `a`.`dampak`, `a`.`solusi`, `a`.`pic`, `a`.`target`, `a`.`nama_kontraktor`, `a`.`nama_paket`, `a`.`status`
FROM `solusi` `a`
JOIN `master_pkp` `b` ON `a`.`id_pkp` = `b`.`id_pkp`
WHERE `a`.`id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
AND `a`.`type` = 'INT'
AND `a`.`id_solusi` = `b`.`id_solusi`
ORDER BY `a`.`nomor`
---
        $tahun = $this->request->getGet('tahun') ?? '00';

        if ($bulan === '00' && $tahun === '00') {
            $data['solusi'] = $this->db
                ->table('solusi a')
                ->select(
                    'a.nomor,a.type,a.masalah,a.penyebab,a.dampak,a.solusi,a.pic,a.target,a.nama_kontraktor,a.nama_paket,a.status'
                )
                ->join('master_pkp b', 'a.id_pkp = b.id_pkp')
                ->where('a.id_pkp', $kode)
                ->where('a.type', 'EKS')
                ->where('a.id_solusi = b.id_solusi')
                ->orderBy('a.nomor', 'ascd')
                ->get()
                ->getResult();

            $data['solusi2'] = $this->db
                ->table('solusi a')
                ->select(
                    'a.nomor,a.type,a.masalah,a.penyebab,a.dampak,a.solusi,a.pic,a.target,a.nama_kontraktor,a.nama_paket,a.status'
                )
                ->join('master_pkp b', 'a.id_pkp = b.id_pkp')
                ->where('a.id_pkp', $kode)
                ->where('a.type', 'INT')
                ->where('a.id_solusi = b.id_solusi')
                ->orderBy('a.nomor', 'ascd')
                ->get()
                ->getResult();

SELECT `a`.`gambar1`, `a`.`gambar2`, `a`.`gambar3`, `a`.`gambar4`, `a`.`gambar5`
FROM `gambar` `a`
JOIN `master_pkp` `b` ON `a`.`id_pkp` = `b`.`id_pkp`
WHERE `a`.`id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
AND `a`.`tgl_ubah` = `b`.`tgl_ubah_gbr`
ORDER BY `a`.`kode` DESC
SELECT `a`.`ket1`, `a`.`ket2`, `a`.`ket3`, `a`.`ket4`, `a`.`ket5`, `a`.`ket6`, `a`.`ket7`, `a`.`ket8`, `a`.`ket9`, `a`.`ket10`, `a`.`ket11`, `a`.`ket12`, `a`.`ket13`, `a`.`ket14`, `a`.`ket15`, `a`.`ket16`, `a`.`ket17`, `a`.`ket18`, `a`.`ket19`, `a`.`ket20`, `a`.`ket21`
FROM `dcr` `a`
JOIN `master_pkp` `b` ON `a`.`id_pkp` = `b`.`id_pkp`
WHERE `a`.`id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
AND `a`.`id_dcr` = `b`.`id_dcr`
SELECT `a`.`pdf1`, `a`.`pdf2`, `a`.`pdf3`, `a`.`pdf4`, `a`.`pdf5`, `a`.`pdf6`, `a`.`pdf7`, `a`.`pdf8`, `a`.`pdf9`, `a`.`pdf10`
FROM `pdf` `a`
JOIN `master_pkp` `b` ON `a`.`id_pkp` = `b`.`id_pkp`
WHERE `a`.`id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
AND `a`.`tgl_ubah` = `b`.`tgl_ubah_dtt`
ORDER BY `a`.`kode` DESC
---
            $data['solusi'] = $solusi;
            $data['solusi2'] = $solusi2;
        }
        $data['gambar'] = $this->db
            ->table('gambar a')
            ->select('a.gambar1,a.gambar2,a.gambar3,a.gambar4,a.gambar5')
            ->join('master_pkp b', 'a.id_pkp = b.id_pkp')
            ->where('a.id_pkp', $kode)
            ->where('a.tgl_ubah = b.tgl_ubah_gbr')
            ->orderBy('a.kode', 'desc')
            ->get();

        $data['dcr'] = $this->db
            ->table('dcr a')
            ->select(
                'a.ket1,a.ket2,a.ket3,a.ket4,a.ket5,a.ket6,a.ket7,a.ket8,a.ket9,a.ket10,a.ket11,a.ket12,a.ket13,a.ket14,a.ket15,a.ket16,a.ket17,a.ket18,a.ket19,a.ket20,a.ket21'
            )
            ->join('master_pkp b', 'a.id_pkp = b.id_pkp')
            ->where('a.id_pkp', $kode)
            ->where('a.id_dcr = b.id_dcr')
            ->get()
            ->getResult();

        $data['pdf'] = $this->db
            ->table('pdf a')
            ->select(
                'a.pdf1,a.pdf2,a.pdf3,a.pdf4,a.pdf5,a.pdf6,a.pdf7,a.pdf8,a.pdf9,a.pdf10'
            )
            ->join('master_pkp b', 'a.id_pkp = b.id_pkp')
            ->where('a.id_pkp', $kode)
            ->where('a.tgl_ubah = b.tgl_ubah_dtt')
            ->orderBy('a.kode', 'desc')
            ->get();

SELECT *
FROM `master_admin`
WHERE `id` = 'USRdbc1087b5a6676dba1c7336a94e85fa3e0ba282dQNS'
SELECT *
FROM `master_instansi`
SELECT *
FROM `master_pkp`
WHERE `id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
 LIMIT 1
SELECT `b`.`alias`
FROM `master_pkp` `a`
JOIN `master_instansi` `b` ON `a`.`id_instansi` = `b`.`id`
WHERE `id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
 LIMIT 1
---
    public function edit_6($kode)
    {
        $data['kode'] = '02';
        $data['id_pkp'] = $this->request->uri->getSegment(4);
        $id_pkp = $this->request->uri->getSegment(4);
        $idQNS = session('idadmin');
        $isi = $this->db
            ->table('master_admin')
            ->where('id', $idQNS, 1)
            ->get()
            ->getRow();
        $kategoriQNS = $isi->kategori_user;
        if (!level_user('proyek', 'data', $kategoriQNS, 'read') > 0) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }
        $data['instansi'] = $this->db
            ->table('master_instansi')
            ->get()
            ->getResult();
        $data['breadcumb'] = $this->db
            ->table('master_pkp')
            ->getWhere(['id_pkp' => $kode], 1);
        $data['divisi'] = $this->db
            ->table('master_pkp a')
            ->select('b.alias')
            ->join('master_instansi b', 'a.id_instansi = b.id')
            ->getWhere(['id_pkp' => $kode], 1);
        $data['proyek'] = $this->db
            ->table('master_pkp')
            ->getWhere(['id_pkp' => $kode], 1);

SELECT `b`.`nomor`
FROM `master_pkp` `a`
JOIN `master_instansi` `b` ON `a`.`id_instansi` = `b`.`id`
WHERE `a`.`id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
SELECT *
FROM `rule_akses`
WHERE `id` = 'RULE1'
 LIMIT 1
---
        $data['tahun'] = substr($data['tgl'], 2, 2);
        $data['bulan'] = substr($data['tgl'], 5, 2);
        $data['option_tahun'] = $this->proyek->option_tahun_absensi($id_pkp);
        $data['instansiQN'] = $this->db
            ->table('master_pkp a')
            ->select('b.nomor')
            ->join('master_instansi b', 'a.id_instansi = b.id')
            ->where('a.id_pkp', $kode)
            ->get();
        $data['nomorQN'] = $data['instansiQN']->getRow()->nomor;

        $satu = 1;
        $data['akses'] = $this->db
            ->table('rule_akses')
            ->getWhere(['id' => 'RULE1'], 1);

SELECT *
FROM `buka_akses`
WHERE `kode` IS NULL
---
        foreach ($QN->getResult() as $row) {
            $kode_akses = $row->masKode;
        }
        $data['buka_akses2'] = $this->db
            ->table('buka_akses')
            ->select('*')
            ->where('kode', $kode_akses)
            ->get()
            ->getResult();

SELECT *
FROM `buka_akses`
WHERE `kode` IS NULL
SELECT `b`.`nomor`
FROM `master_pkp` `a`
JOIN `master_instansi` `b` ON `a`.`id_instansi` = `b`.`id`
WHERE `a`.`id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
SELECT `b`.`nomor`, `b`.`alias`, `b`.`ling`
FROM `master_pkp` `a`
JOIN `master_instansi` `b` ON `a`.`id_instansi` = `b`.`id`
WHERE `a`.`id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
SELECT *
FROM `master_pkp`
WHERE `id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
 LIMIT 1
SELECT `b`.`alias`
FROM `master_pkp` `a`
JOIN `master_instansi` `b` ON `a`.`id_instansi` = `b`.`id`
WHERE `id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
 LIMIT 1
SELECT `a`.`kode_pt`, `b`.`proyek`, `a`.`paket`, `a`.`id_pkp`, `a`.`bobot_pg`, `a`.`rensd_mgll`, `a`.`rilsd_mgll`, `a`.`devsd_mgll`, `a`.`ren_mgini`, `a`.`ril_mgini`, `a`.`dev_mgini`, `a`.`rensd_mgini`, `a`.`rilsd_mgini`, `a`.`devsd_mgini`, `a`.`sisa_bobotpg`, `a`.`tgl_mulai`, `a`.`tgl_selesai`, `a`.`sisa_waktu`, `a`.`target_minggu`, `d`.`alias`
FROM `progress_paket` `a`
JOIN `master_pkp` `b` ON `a`.`id_pkp` = `b`.`id_pkp`
LEFT JOIN `pt_detil` `c` ON `a`.`id_pt` = `c`.`id`
LEFT JOIN `pt_master` `d` ON `c`.`id_pt` = `d`.`id`
WHERE `a`.`id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
AND `a`.`tahun` = '00'
AND `a`.`bulan` = '00'
ORDER BY `a`.`nomor`
SELECT `b`.`proyek`, `a`.`id_pkp`, `a`.`bobot_pg`, `a`.`rensd_mgll`, `a`.`rilsd_mgll`, `a`.`devsd_mgll`, `a`.`ren_mgini`, `a`.`ril_mgini`, `a`.`dev_mgini`, `a`.`rensd_mgini`, `a`.`rilsd_mgini`, `a`.`devsd_mgini`, `a`.`sisa_bobotpg`, `a`.`tgl_mulai`, `a`.`tgl_selesai`, `a`.`sisa_waktu`, `a`.`target_minggu`, `a`.`tgl_ubah_progress`
FROM `progress_proyek` `a`
JOIN `master_pkp` `b` ON `a`.`id_pkp` = `b`.`id_pkp`
WHERE `a`.`id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
AND `a`.`tahun` = '00'
AND `a`.`bulan` = '00'
SELECT *
FROM `progress_proyek`
WHERE `id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
SELECT *
FROM `dt_umum`
WHERE `pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
SELECT *
FROM `dt_umum`
WHERE `pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
ORDER BY `no_urut1`
SELECT `a`.`nomor`, `a`.`type`, `a`.`masalah`, `a`.`penyebab`, `a`.`dampak`, `a`.`solusi`, `a`.`pic`, `a`.`target`
FROM `solusi` `a`
JOIN `master_pkp` `b` ON `a`.`id_pkp` = `b`.`id_pkp`
WHERE `a`.`id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
AND `a`.`type` = 'EKS'
AND `a`.`id_solusi` = `b`.`id_solusi`
ORDER BY `a`.`nomor`
SELECT `a`.`nomor`, `a`.`type`, `a`.`masalah`, `a`.`penyebab`, `a`.`dampak`, `a`.`solusi`, `a`.`pic`, `a`.`target`
FROM `solusi` `a`
JOIN `master_pkp` `b` ON `a`.`id_pkp` = `b`.`id_pkp`
WHERE `a`.`id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
AND `a`.`type` = 'INT'
AND `a`.`id_solusi` = `b`.`id_solusi`
ORDER BY `a`.`nomor`
SELECT `a`.`gambar1`, `a`.`gambar2`, `a`.`gambar3`, `a`.`gambar4`, `a`.`gambar5`
FROM `gambar` `a`
JOIN `master_pkp` `b` ON `a`.`id_pkp` = `b`.`id_pkp`
WHERE `a`.`id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
AND `a`.`tgl_ubah` = `b`.`tgl_ubah_gbr`
ORDER BY `a`.`kode` DESC
SELECT `a`.`ket1`, `a`.`ket2`, `a`.`ket3`, `a`.`ket4`, `a`.`ket5`, `a`.`ket6`, `a`.`ket7`, `a`.`ket8`, `a`.`ket9`, `a`.`ket10`, `a`.`ket11`, `a`.`ket12`, `a`.`ket13`, `a`.`ket14`, `a`.`ket15`, `a`.`ket16`, `a`.`ket17`, `a`.`ket18`, `a`.`ket19`, `a`.`ket20`, `a`.`ket21`
FROM `dcr` `a`
JOIN `master_pkp` `b` ON `a`.`id_pkp` = `b`.`id_pkp`
WHERE `a`.`id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
AND `a`.`id_dcr` = `b`.`id_dcr`
SELECT `a`.`pdf1`, `a`.`pdf2`, `a`.`pdf3`, `a`.`pdf4`, `a`.`pdf5`, `a`.`pdf6`, `a`.`pdf7`, `a`.`pdf8`, `a`.`pdf9`, `a`.`pdf10`
FROM `pdf` `a`
JOIN `master_pkp` `b` ON `a`.`id_pkp` = `b`.`id_pkp`
WHERE `a`.`id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
AND `a`.`tgl_ubah` = `b`.`tgl_ubah_dtt`
ORDER BY `a`.`kode` DESC
SELECT `a`.`kode`, `a`.`bulan`, `a`.`id_pkp`, `a`.`pkp_sebelumnya`, `a`.`tahun`, `b`.`nama_admin`, `a`.`id_user`, `a`.`sakit`, `a`.`ijin`, `a`.`alpha`, `a`.`cuti`, `a`.`ket_absensi`, `b`.`jabatan`, `a`.`ket_jabatan`, `a`.`tgl_ren_mob`, `a`.`tgl_ren_demob`, `a`.`tgl_real_mob`, `a`.`tgl_real_demob`, b.habis_kontrak as 'tgl_akhir_kontrak', `a`.`status`, `a`.`ket_mobdemob`, `a`.`ket_akhir`, `b`.`username`, `d`.`alias`, `b`.`pkp_akhir`
FROM `detil_karyawan` `a`
LEFT JOIN `master_admin` `b` ON `a`.`nrp` = `b`.`username`
JOIN `master_pkp` `c` ON `a`.`id_pkp` = `c`.`id_pkp`
JOIN `master_pkp` `d` ON `a`.`pkp_sebelumnya` = `d`.`id_pkp`
WHERE `a`.`id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
AND `a`.`tgl_update` = `c`.`tgl_ubah_absensi`
ORDER BY `a`.`kode`
SELECT `a`.`bulan`, `a`.`tahun`, `b`.`nama_admin`, `a`.`id_user`, `a`.`sakit`, `a`.`ijin`, `a`.`alpha`, `a`.`cuti`, `a`.`ket_absensi`, `a`.`jabatan`, `a`.`ket_jabatan`, `a`.`tgl_ren_mob`, `a`.`tgl_ren_demob`, `a`.`tgl_real_mob`, `a`.`tgl_real_demob`, `a`.`tgl_akhir_kontrak`, `a`.`status`, `a`.`ket_mobdemob`, `a`.`ket_akhir`, `a`.`nrp`
FROM `detil_karyawan` `a`
LEFT JOIN `master_admin` `b` ON `a`.`nrp` = `b`.`username`
JOIN `master_pkp` `c` ON `a`.`id_pkp` = `c`.`id_pkp`
WHERE `a`.`id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
AND `a`.`tgl_update` = `c`.`tgl_ubah_absensi`
SELECT *
FROM `master_admin`
WHERE `username` NOT IN ('dummykapro','dummy')
AND `pkp_akhir` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
AND `aktif` = '1'
---
            $kode_akses2 = $row2->masKode;
        }

        $data['buka_akses22'] = $this->db
            ->table('buka_akses')
            ->select('*')
            ->where('kode', $kode_akses2)
            ->get()
            ->getResult();
        $data['instansi2'] = $this->db
            ->table('master_pkp a')
            ->select('b.nomor')
            ->join('master_instansi b', 'a.id_instansi = b.id')
            ->where('a.id_pkp', $kode)
            ->get()
            ->getResult();
        $data['instansi3'] = $this->db
            ->table('master_pkp a')
            ->select('b.nomor,b.alias,b.ling')
            ->join('master_instansi b', 'a.id_instansi = b.id')
            ->where('a.id_pkp', $kode)
            ->get();
        $data['breadcumb'] = $this->db
            ->table('master_pkp')
            ->getWhere(['id_pkp' => $kode], 1);
        $data['divisi'] = $this->db
            ->table('master_pkp a')
            ->select('b.alias')
            ->join('master_instansi b', 'a.id_instansi = b.id')
            ->getWhere(['id_pkp' => $kode], 1);
        $data['paket'] = $this->db
            ->table('progress_paket a')
            ->select(
                'a.kode_pt,b.proyek,a.paket,a.id_pkp,a.bobot_pg,a.rensd_mgll,a.rilsd_mgll,a.devsd_mgll,a.ren_mgini,a.ril_mgini,a.dev_mgini,a.rensd_mgini,a.rilsd_mgini,a.devsd_mgini,a.sisa_bobotpg,a.tgl_mulai,a.tgl_selesai,a.sisa_waktu,a.target_minggu,d.alias'
            )
            ->join('master_pkp b', 'a.id_pkp = b.id_pkp')
            ->join('pt_detil c', 'a.id_pt = c.id', 'left')
            ->join('pt_master d', 'c.id_pt = d.id', 'left')
            ->where('a.id_pkp', $kode)
            ->where('a.tahun', $data['tahun'])
            ->where('a.bulan', $data['bulan'])
            ->orderBy('a.nomor', 'ascd')
            ->get()
            ->getResult();

        $data['proyek2'] = $this->db
            ->table('progress_proyek a')
            ->select(
                'b.proyek,a.id_pkp,a.bobot_pg,a.rensd_mgll,a.rilsd_mgll,a.devsd_mgll,a.ren_mgini,a.ril_mgini,a.dev_mgini,a.rensd_mgini,a.rilsd_mgini,a.devsd_mgini,a.sisa_bobotpg,a.tgl_mulai,a.tgl_selesai,a.sisa_waktu,a.target_minggu,a.tgl_ubah_progress'
            )
            ->join('master_pkp b', 'a.id_pkp = b.id_pkp')
            ->where('a.id_pkp', $kode)
            ->where('a.tahun', $data['tahun'])
            ->where('a.bulan', $data['bulan'])
            ->get()
            ->getResult();

        $data['cek_pro'] = $this->db
            ->table('progress_proyek')
            ->where('id_pkp', $kode, 1)
            ->get();

        $data['cek2'] = $this->db
            ->table('dt_umum')
            ->where('pkp', $kode, 1)
            ->get();

        $data['dt_umum'] = $this->db
            ->table('dt_umum')
            ->select('*')
            ->where('pkp', $kode)
            ->orderBy('no_urut1', 'ascd')
            ->get()
            ->getResult();

        $data['solusi'] = $this->db
            ->table('solusi a')
            ->select(
                'a.nomor,a.type,a.masalah,a.penyebab,a.dampak,a.solusi,a.pic,a.target'
            )
            ->join('master_pkp b', 'a.id_pkp = b.id_pkp')
            ->where('a.id_pkp', $kode)
            ->where('a.type', 'EKS')
            ->where('a.id_solusi = b.id_solusi')
            ->orderBy('a.nomor', 'ascd')
            ->get()
            ->getResult();

        $data['solusi2'] = $this->db
            ->table('solusi a')
            ->select(
                'a.nomor,a.type,a.masalah,a.penyebab,a.dampak,a.solusi,a.pic,a.target'
            )
            ->join('master_pkp b', 'a.id_pkp = b.id_pkp')
            ->where('a.id_pkp', $kode)
            ->where('a.type', 'INT')
            ->where('a.id_solusi = b.id_solusi')
            ->orderBy('a.nomor', 'ascd')
            ->get()
            ->getResult();

        $data['gambar'] = $this->db
            ->table('gambar a')
            ->select('a.gambar1,a.gambar2,a.gambar3,a.gambar4,a.gambar5')
            ->join('master_pkp b', 'a.id_pkp = b.id_pkp')
            ->where('a.id_pkp', $kode)
            ->where('a.tgl_ubah = b.tgl_ubah_gbr')
            ->orderBy('a.kode', 'desc')
            ->get();

        $data['dcr'] = $this->db
            ->table('dcr a')
            ->select(
                'a.ket1,a.ket2,a.ket3,a.ket4,a.ket5,a.ket6,a.ket7,a.ket8,a.ket9,a.ket10,a.ket11,a.ket12,a.ket13,a.ket14,a.ket15,a.ket16,a.ket17,a.ket18,a.ket19,a.ket20,a.ket21'
            )
            ->join('master_pkp b', 'a.id_pkp = b.id_pkp')
            ->where('a.id_pkp', $kode)
            ->where('a.id_dcr = b.id_dcr')
            ->get()
            ->getResult();

        $data['pdf'] = $this->db
            ->table('pdf a')
            ->select(
                'a.pdf1,a.pdf2,a.pdf3,a.pdf4,a.pdf5,a.pdf6,a.pdf7,a.pdf8,a.pdf9,a.pdf10'
            )
            ->join('master_pkp b', 'a.id_pkp = b.id_pkp')
            ->where('a.id_pkp', $kode)
            ->where('a.tgl_ubah = b.tgl_ubah_dtt')
            ->orderBy('a.kode', 'desc')
            ->get();

        $data['detil_karyawan3'] = $this->db
            ->table('detil_karyawan a')
            ->select(
                "a.kode,a.bulan,a.id_pkp,a.pkp_sebelumnya,a.tahun,b.nama_admin,a.id_user,a.sakit,a.ijin,a.alpha,a.cuti,a.ket_absensi,b.jabatan,a.ket_jabatan,a.tgl_ren_mob,a.tgl_ren_demob,a.tgl_real_mob,a.tgl_real_demob,b.habis_kontrak as 'tgl_akhir_kontrak',a.status,a.ket_mobdemob,a.ket_akhir,b.username,d.alias,b.pkp_akhir"
            )
            ->join('master_admin b', 'a.nrp = b.username', 'left')
            ->join('master_pkp c', 'a.id_pkp = c.id_pkp')
            ->join('master_pkp d', 'a.pkp_sebelumnya = d.id_pkp')
            ->where('a.id_pkp', $kode)
            ->where('a.tgl_update = c.tgl_ubah_absensi')
            ->orderBy('a.kode', 'ASCD')
            ->get();

        if ($data['detil_karyawan3']->getNumRows() > 0) {
            $data['detil_karyawan2'] = $this->db
                ->table('detil_karyawan a')
                ->select(
                    'a.bulan,a.tahun,b.nama_admin,a.id_user,a.sakit,a.ijin,a.alpha,a.cuti,a.ket_absensi,a.jabatan,a.ket_jabatan,a.tgl_ren_mob,a.tgl_ren_demob,a.tgl_real_mob,a.tgl_real_demob,a.tgl_akhir_kontrak,a.status,a.ket_mobdemob,a.ket_akhir,a.nrp'
                )
                ->join('master_admin b', 'a.nrp = b.username', 'left')
                ->join('master_pkp c', 'a.id_pkp = c.id_pkp')
                ->where('a.id_pkp', $kode)
                ->where('a.tgl_update = c.tgl_ubah_absensi')
                ->get()
                ->getResultArray();
            $result2 = array_column($data['detil_karyawan2'], 'nrp');

            $data['detil_no_list'] = $this->db
                ->table('master_admin')
                ->select('*')
                ->orWhereNotIn('username', $result2)
                ->where('pkp_akhir', $kode)
                ->where('aktif', '1')
                ->get()
                ->getResult();

SELECT `b`.`sisa_cuti`, `b`.`tgl_kontrak`, `a`.`kode`, `a`.`bulan`, `a`.`id_pkp`, `a`.`pkp_sebelumnya`, `a`.`tahun`, `b`.`nama_admin`, `a`.`id_user`, `a`.`sakit`, `a`.`ijin`, `a`.`alpha`, `a`.`cuti`, `a`.`ket_absensi`, `b`.`jabatan`, `a`.`ket_jabatan`, `a`.`tgl_ren_mob`, `a`.`tgl_ren_demob`, `a`.`tgl_real_mob`, `a`.`tgl_real_demob`, b.habis_kontrak as 'tgl_akhir_kontrak', `a`.`status`, `a`.`ket_mobdemob`, `a`.`ket_akhir`, `b`.`username`, `d`.`alias`, `b`.`pkp_akhir`, `b`.`tgl_respon`, `a`.`nama`, `a`.`nrp`
FROM `detil_karyawan` `a`
LEFT JOIN `master_admin` `b` ON `a`.`nrp` = `b`.`username`
JOIN `master_pkp` `c` ON `a`.`id_pkp` = `c`.`id_pkp`
LEFT JOIN `master_pkp` `d` ON `a`.`pkp_sebelumnya` = `d`.`id_pkp`
WHERE `a`.`id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
AND `a`.`tgl_update` = `c`.`tgl_ubah_absensi`
ORDER BY `a`.`kode`
---
        $tahun = $this->request->getGet('tahun') ?? '00';

        if ($bulan === '00' && $tahun === '00') {
            $data['detil_karyawan'] = $this->db
                ->table('detil_karyawan a')
                ->select(
                    "b.sisa_cuti,b.tgl_kontrak,a.kode,a.bulan,a.id_pkp,a.pkp_sebelumnya,a.tahun,b.nama_admin,a.id_user,a.sakit,a.ijin,a.alpha,a.cuti,a.ket_absensi,b.jabatan,a.ket_jabatan,a.tgl_ren_mob,a.tgl_ren_demob,a.tgl_real_mob,a.tgl_real_demob,b.habis_kontrak as 'tgl_akhir_kontrak',a.status,a.ket_mobdemob,a.ket_akhir,b.username,d.alias,b.pkp_akhir,b.tgl_respon,a.nama,a.nrp"
                )
                ->join('master_admin b', 'a.nrp = b.username', 'left')
                ->join('master_pkp c', 'a.id_pkp = c.id_pkp')
                ->join('master_pkp d', 'a.pkp_sebelumnya = d.id_pkp', 'left')
                ->where('a.id_pkp', $kode)
                ->where('a.tgl_update = c.tgl_ubah_absensi')
                ->orderBy('a.kode', 'ASCD')
                ->get()
                ->getResult();

DELETE FROM `solusi`
WHERE `tgl_ubah` = '2024-09-30'
AND `id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
---
                "SELECT * FROM solusi where tgl_ubah='$now' and id_pkp='$id_pkp58'"
            );
            if ($QN01->getNumRows() > 0) {
                $this->db
                    ->table('solusi')
                    ->where('tgl_ubah', $now)
                    ->where('id_pkp', $id_pkp58)
                    ->delete();

UPDATE `master_pkp` SET `tgl_ubah_masalah` = '2024-09-30', `id_solusi` = 'IDS2409-00033'
WHERE `id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
---
                'tgl_ubah_masalah' => $now,
                'id_solusi' => $kode3,
            ];
            $this->db
                ->table('master_pkp')
                ->where('id_pkp', $id_pkp58)
                ->update($data0);

UPDATE `master_pkp` SET `tgl_ubah_masalah` = '2024-10-02', `id_solusi` = 'IDS2410-00001'
WHERE `id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
---
            $datagbr1 = [
                'file_dtu' => $lokasi . '/' . $fileName,
            ];
            $this->db
                ->table('master_pkp')
                ->where('id_pkp', $id_pkp)
                ->update($datagbr1);

UPDATE `master_pkp` SET `tgl_ubah` = '2024-10-01'
WHERE `id_pkp` = 'PKP0ebc39348ac7ff819f0b4ac2577979bc7b88bc03QNS'
---
        $dataend = [
            'tgl_ubah_dtu' => $now,
        ];
        $this->db
            ->table('master_pkp')
            ->where('id_pkp', $id_pkp)
            ->update($dataend);