app/Controllers/Proyek.php

        $idQNS = session('idadmin');
        // $baris++;
        $noUrut++;
        $no = $this->db->table('solusi')->where('id_solusi', $order3)->selectMax('nomor')->get()->getRow();
---
SELECT MAX(`nomor`) AS `nomor`
FROM `solusi`
WHERE `id_solusi` = 'IDS2410-00001'