app/Models/DashboardModel.php

SELECT *
FROM `master_admin`
WHERE `id` = 'USRdbc1087b5a6676dba1c7336a94e85fa3e0ba282dQNS'
---
    public function getId()
    {
        $id = session()->get('idadmin');

        return $this->db->table('master_admin')
            ->where('id', $id)
            ->get()
            ->getRow();

SELECT `b`.`alias`, `b`.`no_pkp`, `c`.`nomor`
FROM `master_admin` `a`
JOIN `master_pkp` `b` ON `a`.`pkp_user` = `b`.`id_pkp`
JOIN `master_instansi` `c` ON `b`.`id_instansi` = `c`.`id`
JOIN `kategori_user` `d` ON `a`.`kategori_user` = `d`.`id`
WHERE `a`.`id` = 'USRdbc1087b5a6676dba1c7336a94e85fa3e0ba282dQNS'
---
    public function getOne()
    {
        $id = session()->get('idadmin');

        return $this->db->table('master_admin a')
            ->select('b.alias, b.no_pkp, c.nomor')
            ->join('master_pkp b', 'a.pkp_user = b.id_pkp')
            ->join('master_instansi c', 'b.id_instansi = c.id')
            ->join('kategori_user d', 'a.kategori_user = d.id')
            ->where('a.id', $id)
            ->get()
            ->getResult();

SELECT `b`.`alias`, `b`.`no_pkp`, `c`.`nomor`, `a`.`nama_admin`, `d`.`kategori_user`
FROM `master_admin` `a`
JOIN `master_pkp` `b` ON `a`.`pkp_user` = `b`.`id_pkp`
JOIN `master_instansi` `c` ON `b`.`id_instansi` = `c`.`id`
JOIN `kategori_user` `d` ON `a`.`kategori_user` = `d`.`id`
WHERE `a`.`id` = 'USRdbc1087b5a6676dba1c7336a94e85fa3e0ba282dQNS'
---
    public function getTwo()
    {
        $id = session()->get('idadmin');

        return $this->db->table('master_admin a')
            ->select('b.alias, b.no_pkp, c.nomor, a.nama_admin, d.kategori_user')
            ->join('master_pkp b', 'a.pkp_user = b.id_pkp')
            ->join('master_instansi c', 'b.id_instansi = c.id')
            ->join('kategori_user d', 'a.kategori_user = d.id')
            ->where('a.id', $id)
            ->get()
            ->getRow();

SELECT MAX(`kode`) AS `masKode`
FROM `log`
ORDER BY `kode` DESC
---
    public function getMaxKode()
    {
        $query = $this->db->table('log')
            ->selectMax('kode', 'masKode')
            ->orderBy('kode', 'desc')
            ->get();