app/Models/LoginModel.php

    public function getKategoriUser($kategoriId)
    {
        $query = $this->db->table('kategori_user a')
            ->select('a.kategori_user, b.controller, b.nama_function')
            ->join('modul b', 'b.id = a.beranda')
            ->where('a.id', $kategoriId)
            ->get();
---
SELECT `a`.`kategori_user`, `b`.`controller`, `b`.`nama_function`
FROM `kategori_user` `a`
JOIN `modul` `b` ON `b`.`id` = `a`.`beranda`
WHERE `a`.`id` = 'JBT8b4e1656e7b810f70d908c97ae1e61e26d592b25QNS'