app/Models/ProyekModel.php

    public function option_tahun($id_pkp)
    {
        $builder = $this->db->table('progress_paket');

        $builder->select('tahun');
        $builder->where('id_pkp', $id_pkp);
        $builder->orderBy('tahun', 'ASC');
        $builder->distinct();
        $builder->groupBy('tahun', 'ASC');

        return $builder->get()->getResult();
---
SELECT DISTINCT `tahun`
FROM `progress_paket`
WHERE `id_pkp` = ''
GROUP BY `tahun`
ORDER BY `tahun` ASC

    public function option_tahun_msl($id_pkp)
    {

        $builder = $this->db->table('solusi');
        $builder->select('tgl_ubah');
        $builder->distinct();
        $builder->where('id_pkp', $id_pkp);
        $builder->orderBy('YEAR(tgl_ubah)', 'ASC');

        return $builder->get()->getResult();
---
SELECT DISTINCT `tgl_ubah`
FROM `solusi`
WHERE `id_pkp` = ''
ORDER BY YEAR(tgl_ubah) ASC

    public function option_tahun_absensi($id_pkp)
    {

        $builder = $this->db->table('detil_karyawan');
        $builder->select('tahun');
        $builder->distinct();
        $builder->where('id_pkp', $id_pkp);
        $builder->orderBy('tahun', 'ASC');

        return $builder->get()->getResult();
---
SELECT DISTINCT `tahun`
FROM `detil_karyawan`
WHERE `id_pkp` = ''
ORDER BY `tahun` ASC